[About Language File]
Comments=Jos löydät käännösvirheitä, niin kerro minulle. Kiitos.
Date=25.06.2022
Email=info@texteditor.pro
Version=23.1.0

[AboutDialog]
Caption=Tietoja ohjelmasta
LabelCopyright=Tekijänoikeudet %s. Kaikki oikeudet pidätetään.
LabelFeedback=Palaute
LabelIcons=Ikonit
LabelLanguageFileContributors=Kielitiedostojen avustajat
LabelLicense=Tämä tuote on aina ILMAINEN sinulle. Katso lisenssi.
LabelMemoryAvailable=Käytettävissä oleva muisti: %s
LabelThirdPartyComponents=Kolmansienosapuolien komponentit
LabelVersion=Versio %s (%d-bittinen)
LabelWebsite=Kotisivu

[AskYesOrNo]
CancelSearch=Peruuta haku, oletko varma?
CheckInternationalCharacters=Tiedosto "%s" sisältää kansainvälisiä merkkejä.%sVaihda koodaus säilyttääksesi merkit.%sTallennetaanko silti?
CloseDirectory=Sulje hakemisto %s, oletko varma?
DeleteDirectory=Poista hakemisto %s, oletko varma?
DeleteFile=Poista tiedosto %s, oletko varma?
DeleteLine=Poista rivi, oletko varma?
NewVersion=Uusi versio %s %ssta on saatavilla.  %sHaluatko ladata sen Internetistä?
RecordMacro=Nauhoita uusi makro, oletko varma?
ReopenFileWithEncoding=Avaa tiedosto uudelleen "%s" -koodauksella?
ReplaceOccurence=Korvaa tämä "%s" esiintymä?
ResetColor=Palauta %s väritiedosto, oletko varma?
SaveChanges=Tallenna muutokset?
SearchMatchNotFound=Etsittyä merkkijonoa ei löydy.%sKäynnistetäänkö etsintä tiedoston alusta uudelleen?
SearchStringNotFound=Etsittyä merkkijonoa "%s" ei löydy

[ChangedFilesDialog]
Caption=Lataa uudelleen muuttuneet tiedostot
VirtualDrawTree:0=Tiedosto
VirtualDrawTree:1=Polku

[ClipboardHistoryDialog]
ActionClearAll=Tyhjennä kaikki
ActionCopyToClipboard=Kopioi leikepöydälle
ActionInsertInEditor=Lisää editoriin
Caption=Leikepöydän historia

[ColorConstant]
SColorBoxCustomCaption=Muokattu...
SName3DDkShadow=3D tumma varjo
SName3DLight=3D valo
SNameActiveBorder=Aktiivinen reuna
SNameActiveCaption=Aktiivinen otsikko
SNameAppWorkSpace=Sovelluksen työtila
SNameAqua=Vesi
SNameBackground=Taustaväri
SNameBlack=Musta
SNameBlue=Sininen
SNameBtnFace=Painike
SNameBtnHighlight=Painikekorostus
SNameBtnShadow=Painikevarjo
SNameBtnText=Painiketeksti
SNameCaptionText=Otsikkoteksti
SNameCream=Kerma
SNameDefault=Oletus
SNameFuchsia=Fuksia
SNameGradientActiveCaption=Aktiivinen otsikko liuku
SNameGradientInactiveCaption=Toimeton otsikko liuku
SNameGray=Harmaa
SNameGrayText=Harmaa teksti
SNameGreen=Vihreä
SNameHighlight=Taustakorostus
SNameHighlightText=Tekstin korostus
SNameHotLight=Kuuma valo
SNameInactiveBorder=Toimeton reuna
SNameInactiveCaption=Toimeton otsikko
SNameInactiveCaptionText=Toimeton otsikkoteksti
SNameInfoBk=Tiedoksitausta
SNameInfoText=Tiedoksiteksti
SNameLime=Lime
SNameMaroon=Kastanjanruskea
SNameMedGray=Keskiharmaa
SNameMenu=Valikon tausta
SNameMenuBar=Valikkorivi
SNameMenuHighlight=Valikkokorostus
SNameMenuText=Valikkoteksti
SNameMoneyGreen=Rahanvihreä
SNameNavy=Laivastonsininen
SNameNone=Ei mitään
SNameOlive=Oliivi
SNamePurple=Violetti
SNameRed=Punainen
SNameScrollBar=Vierityspalkki
SNameSilver=Hopea
SNameSkyBlue=Taivaansininen
SNameTeal=Tavi
SNameWhite=Valkoinen
SNameWindow=Ikkunatausta
SNameWindowFrame=Ikkunakehys
SNameWindowText=Ikkunateksti
SNameYellow=Keltainen

[CompareForm]
ActionExit:h=Poistu tekstivertailusta
ActionExit=Poistu
ActionLeftCopy:h=Kopioi valitut rivit oikeaan tiedostoon
ActionLeftCopy=Kopioi
ActionLeftFileOpen:h=Avaa tiedosto
ActionLeftFileOpen=Avaa
ActionLeftFileSave:h=Tallenna tiedosto
ActionLeftFileSave=Tallenna
ActionLeftNext:h=Siirry seuraavaan eroavaisuuteen
ActionLeftNext:s=F3
ActionLeftNext=Seuraava
ActionLeftPrevious:h=Siirry edelliseen eroavaisuuteen
ActionLeftPrevious:s=Shift+F3
ActionLeftPrevious=Edellinen
ActionLeftReload:h=Lataa tiedosto uudelleen
ActionLeftReload=Lataa uudelleen
ActionLeftSwap:h=Vaihda valitut rivit oikean tiedoston kanssa
ActionLeftSwap=Vaihda
ActionOptions:h=Tekstin vertailuasetukset
ActionOptions=Asetukset
ActionRightCopy:h=Kopioi valitut rivit vasempaan tiedostoon
ActionRightCopy=Kopioi
ActionRightFileOpen:h=Avaa tiedosto
ActionRightFileOpen=Avaa
ActionRightFileSave:h=Tallenna tiedosto
ActionRightFileSave=Tallenna
ActionRightNext:h=Siirry seuraavaan eroavaisuuteen
ActionRightNext:s=F4
ActionRightNext=Seuraava
ActionRightPrevious:h=Siirry edelliseen eroavaisuuteen
ActionRightPrevious:s=Shift+F4
ActionRightPrevious=Edellinen
ActionRightReload:h=Lataa tiedosto uudelleen
ActionRightReload=Lataa uudelleen
ActionRightSwap:h=Vaihda valitut rivit vasemman tiedoston kanssa
ActionRightSwap=Vaihda
ActionSearchFindPrevious:h=Seuraava
ActionSearchFindPrevious:s=Shift+Ctrl+F3
ActionSearchFindNext:h=Edellinen
ActionSearchFindNext:s=Ctrl+F3
ActionSearchMatchCase:h=Merkkikokoriippuvaisuus
ActionSearchMatchCase=Merkkikokoriippuvaisuus
ActionSearchWholeWords:h=Kokonaiset sanat
ActionSearchWholeWords=Kokonaiset sanat
ActionSearchClose:h=Sulje
Caption=Tekstivertailu

[CompareOptionsDialog]
Caption=Tekstin vertailuasetukset
CheckBoxIgnoreBlanks=Ei välitetä tyhjistä merkeistä
CheckBoxIgnoreCase=Ei välitetä merkin koosta
CheckBoxShowSpecialChars=Näytä erikoismerkit
ComboBoxColorTheme=Väriteema

[ConfirmReplaceDialog]
Caption=Vahvista korvaus

[Constant]
Active=Aktiivinen
ActualSize=Todellinen koko
AddFile=Lisää tiedosto
AllFiles=Kaikki tiedostot
Arrow=Nuoli
AutoSave=Autom. tallennus
Block=Lohko
Blue=Sininen
Bookmark=Kirjanmerkki
Bookmarks=Kirjanmerkit
Bottom=Alareuna
Bytes=tavua
CharacterCount=Merkkien lukumäärä
Circle=Ympyrä
Color=Väri
CompareFiles=Vertaa tiedostoja
Confirmation=Varmistus
Connecting=Yhdistää
CountingFiles=Lasketaan tiedostoja...
Dash=Viiva
Default=Oletus
DirectoryItems=Hakemistot
DocumentIsValid=Dokumentti on validi.
Dot=Piste
DoubleUnderline=Tupla-alleviivaus
Download=Lataa
DownloadCancelling=Peruutetaan...
DownloadDone=Suoritettu.
EditDirectory=Muokkaa hakemistoa
Encoding=Koodaus
Enter=Rivinvaihto
Error=Virhe
Extended=Laajennettu - \n, \t, \0
FavouriteItems=Suosikkikohteet
FileMaskItems=Tiedostosuodattimet
FilesFound=%d tiedosto(a) löydettiin ajassa %s
FitHeight=Sovita korkeus 
FitWidth=Sovita leveys
Gigabyte=Gt
GoToBookmark=Mene kirjanmerkkiin
GoToLine=Mene riville
Green=Vihreä
HalfBlock=Puolilohko
Hide=Piilota
Highlighter=Korostus
HorizontalLine=Vaakaviiva
Hovered=Hiiri päällä
Inactive=Ei-aktiivinen
Information=Tiedoksi
Insert=Lisäys
InsertTags=Lisää HTML/XML tagi
Installer=Asennustiedosto
InvalidName=Virheellinen nimi
Keyword=Avainsana
Kilobyte=Kt
LanguageEditor=Kielieditori - %s
Left=Vasen
Length=Pituus
Line=Rivi
LineCount=Rivien lukumäärä
LoadingFile=Ladataan tiedostoa...
LoadingFiles=Ladataan tiedostoja...
LoadingOutput=Ladataan hakutuloksia...
LowerCase=Pienet kirjaimet
MatchFound=%d osuma%s löytyi
MatchFoundPluralExtension=a
Megabyte=Mt
Memory=Muisti
Minute=min
Modified=Muokattu
NewFolder=Uusi hakemisto
NoChange=Ei muutosta
None=Ei mitään
Normal=Normaali
OccurencesFound=%d esiintymää löydetty %s
Open=Avaa
OpenDirectory=Avaa hakemisto
Overwrite=Korvaus
Page=Sivu
Password=Salasana
Pilcrow=Kappaleen merkki
PleaseWait=Odota
Position=Paikka: %d
PreviewFilePage=Sivu: $PAGENUM$/$PAGECOUNT$
PreviewPage=Sivu: %d / %d
PreviewPrintFile=Tulosta (%s)|Tulosta tiedosto %s
PrintedBy=Tulostettu %slla
ProcessingFile=Käsitellään tiedostoa...
Purple=Purppura
ReadOnly=Lukutila
Red=Punainen
RegularExpression=Säännöllinen lauseke
Rename=Haluatko uudelleen nimetä tiedoston "%s" tiedostoksi "%s"?
RenameFailed=%s uudelleen nimeäminen epäonnistui
RenameTab=Nimeä välilehti uudelleen 
ReopenItems=Uudelleen avattavat tiedostot
Results=Tulokset
Right=Oikea
RightMargin=Oikea marginaali
SaveAs=Tallenna nimellä
Search=haku
SearchFor=Etsi "%s"
SearchItems=Haetut kohteet
Second=s
SelectRootDirectory=Valitse juurihakemisto
SelectWorkingDirectory=Valitse työhakemisto
SentenceCase=Lauseke kirjaimet
Separator=Välimerkkijono
ShowOnlyInList=Näytä vain listalla
Snippet=Katkelma
Solid=Umpinainen
Speed=Nopeus
Square=Neliö
Text=Teksti
TextToFindItems=Etsi kohteet
ThinHorizontalLine=Ohut vaakaviiva
ThinVerticalLine=Ohut pystyviiva
ToggleBookmark=Vaihda kirjanmerkkiä
Top=Yläreuna
TopLine=Ylin rivi: %d
Triangle=Kolmio
Underline=Alleviivaus
Untitled=Nimetön
UpperCase=Suuret kirjaimet
UseOnAllHighlighters=Käytä kaikilla korostuksilla
VersionInfoNotFound=Versiotietoja ei löydy.
VerticalLine=Pystyviiva
Warning=Varoitus
WaveLine=Aaltoviiva
WavyZigzag=Aaltoileva siksak
Width=Pituus
Wildcard=Villikortti - *, ?, #
WordCount=Sanojen lukumäärä
Yellow=Keltainen 
ZipPackage=Zip -paketti

[ConvertConstant]
AcreFeet=Eekkerijalka
AcreInches=Eekkerituuma
Acres=Eekkeri
Angstroms=Angstrom
Area=Pinta-ala
Ares=Aari
AstronomicalUnits=Tähtitieteellinen yksikkö
Binary=Binääri
Celsius=Celsius
Centares=Neliömetri
Centigrams=Senttigramma
CentiLiters=Senttilitra
Centimeters=Senttimetri
Centuries=Vuosisata
Chains=Mittaketju
CordFeet=Narujalka
Cords=Naru
CubicCentimeters=Kuutiosenttimetri
CubicDecameters=Kuutiodekametri
CubicDecimeters=Kuutiodesimetri
CubicFeet=Kuutiojalka
CubicHectometers=Kuutiohehtometri
CubicInches=Kuutiotuuma
CubicKilometers=Kuutiokilometri
CubicMeters=Kuutiometri
CubicMiles=Kuutiomaili
CubicMillimeters=Kuutiomillimetri
CubicYards=Kuutiojaardi
Cubits=Kyynärä
DateTime=Päiväys aika
Days=Päivä
Decades=Vuosikymmen
Decagrams=Decagramma
DecaLiters=Dekalitra
Decameters=Dekametri
Decasteres=Decasteres
Decigrams=Desigramma
DeciLiters=Desilitra
Decimal=Desimaali
Decimeters=Desimetri
Decisteres=Decisteres
Distance=Etäisyys
Drams=Dram
DryBuckets=Kuiva ämpäri
DryBushels=Kuiva vakka
DryGallons=Kuiva gallona
DryPecks=Kuiva Peck
DryPints=Kuiva pintti
DryQuarts=Kuiva gallona
Fahrenheit=Fahrenheit
Fathoms=Syli
Feet=Jalka
FluidCups=Neste kuppi
FluidGallons=Neste gallona
FluidGills=Neste gill
FluidOunces=Neste unssi
FluidPints=Neste pintti
FluidQuarts=Neste gallona
FluidTablespoons=Neste pöytälusikka
FluidTeaspoons=Neste teelusikka
Fortnights=Kaksi viikkoa
Furlongs=Vako
Gigameters=Gigametri
Grains=Graani
Grams=Gramma
Hands=Käsi
Hectares=Hehtaari
Hectograms=Hehtogramma
HectoLiters=Hehtolitra
Hectometers=Hehtometri
Hexadecimal=Heksadesimaali
Hours=Tunti
Inches=Tuuma
JulianDate=Juliaaninen päiväys
Kelvin=Kelvin
Kilograms=Kilogramma
KiloLiters=Kilolitra
Kilometers=Kilometri
LightYears=Valovuosi
Links=Link
Liters=Litra
LongTons=Pitkä tonni
Mass=Paino
Megameters=Megametri
Meters=Metri
MetricTons=Metrinen tonni
Micrograms=Mikrogramma
Micromicrons=Mikromikroni
Microns=Mikroni
Miles=Maili
Millennia=Vuosituhat
Milligrams=Milligramma
MilliLiters=Millilitra
Millimeters=Millimetri
Millimicrons=Millimikroni
MilliSeconds=Millisekunti
Minutes=Minuutti
ModifiedJulianDate=Muokattu Juliaaninen päiväys
Months=Kuukausi
Nanograms=Nanogramma
NauticalMiles=Merimaili
NumeralSystem=Numeeriset järjestelmät
Ounces=Unssi
Paces=Askel
Parsecs=Tähtiväli
Picas=Pica
Points=Typograafinen piste
Pounds=Pauna
Rankine=Rankine
Reaumur=Reaumur
Rods=Tanko
Seconds=Sekunti
SquareCentimeters=Neliösenttimetri
SquareDecameters=Neliödekametri
SquareDecimeters=Neliödesimetri
SquareFeet=Neliöjalka
SquareHectometers=Neliöhehtometri
SquareInches=Neliötuuma
SquareKilometers=Neliökilometri
SquareMeters=Neliömetri
SquareMiles=Neliömaili
SquareMillimeters=Neliömillimetri
SquareRods=Neliötanko
SquareYards=Neliöjaardi
Steres=Steres
Stones=Kivi
Temperature=Lämpötila
Time=Aika
Tons=Tonni
UKBuckets=UK ämpäri
UKBushels=UK vakka
UKGallons=Gallona
UKGill=UK gill
UKOunces=UK unssi
UKPecks=UK peck
UKPints=Pintti
UKPottle=UK pottle
UKQuarts=UK gallona
Weeks=Viikko
Volume=Tilavuus
Yards=Jaardi
Years=Vuosi

[ConvertForm]
Caption=Muunna numeraalisten yksiköinen välillä
ComboBoxFrom=Mistä
ComboBoxTo=Miksi
ComboBoxType=Tyyppi
EditResult=Tulos
EditValue=Arvo

[DialogConstant]
SMsgDlgAbort=&Peru
SMsgDlgAll=&Kaikki
SMsgDlgCancel=Peruuta
SMsgDlgClose=&Sulje
SMsgDlgConfirm=Varmista
SMsgDlgError=Virhe
SMsgDlgHelp=&Ohje
SMsgDlgHelpHelp=Ohje
SMsgDlgHelpNone=Ei ohjetta saatavana
SMsgDlgIgnore=&Sivuuta
SMsgDlgInformation=Tiedotus
SMsgDlgNo=&Ei
SMsgDlgNoToAll=E&i kaikkiin
SMsgDlgOK=OK
SMsgDlgRetry=&Yritä uudelleen
SMsgDlgWarning=Varoitus
SMsgDlgYes=&Kyllä
SMsgDlgYesToAll=K&yllä kaikkiin
SNoMappingForUnicodeCharacter=Tavoitteena olevan monitavuisen koodisivun kohdalla ei löydy Unicode -merkille vastaavuutta.

[DirectoryTabDialog]
CheckBoxExcludeOtherDirectoryBranches=Sulje pois muut hakemistopolut
ComboBoxDrives=Asemat
ComboBoxFileMask=Tiedostosuodatin
EditRootDirectory=Juurihakemisto
EditTabName=Sivun nimi
GroupBoxOptions=Valinnat

[DownloadURLDialog]
ActionCancel=Peruuta
ActionOK=OK
Caption=Lataa

[EditorColorElements]
ActiveLineBackground=Aktiivisen rivin tausta
ActiveLineBackgroundUnfocused=Aktiivisen rivin tausta ei kohdennettu
ActiveLineForeground=Aktiivisen rivin teksti
ActiveLineForegroundUnfocused=Aktiivisen rivin teksti ei kohdennettu
Background=Tausta
CodeFoldingActiveLineBackground=Koodin taiton aktiivisen rivin tausta
CodeFoldingActiveLineBackgroundUnfocused=Koodin taiton aktiivisen rivin tausta ei kohdennettu
CodeFoldingBackground=Koodin taiton tausta
CodeFoldingCollapsedLine=Koodin taiton kokoon taitettu viiva
CodeFoldingFoldingLine=Koodin taiton taittoviiva
CodeFoldingFoldingLineHighlight=Koodin taiton taittoviivan korostus
CodeFoldingHintBackground=Koodin taiton vinkin tausta
CodeFoldingHintBorder=Koodin taiton vinkin reuna
CodeFoldingHintIndicatorBackground=Koodin taiton vinkin indikaattorin tausta
CodeFoldingHintIndicatorBorder=Koodin taiton vinkin indikaattorin reuna
CodeFoldingHintIndicatorMark=Koodin taiton vinkin indikaattorin merkki
CodeFoldingHintText=Koodin taiton vinkin teksti
CodeFoldingIndent=Koodin taiton sisennys
CodeFoldingIndentHighlight=Koodin taiton sisennyksen korostus
CompletionProposalBackground=Täydennysehdotuksen tausta
CompletionProposalForeground=Täydennysehdotuksen teksti
CompletionProposalSelectedBackground=Täydennysehdotuksen valitun tausta
CompletionProposalSelectedText=Täydennysehdotuksen valitun teksti
LeftMarginActiveLineBackground=Vasemman marginaalin aktiivisen rivin tausta
LeftMarginActiveLineBackgroundUnfocused=Vasemman marginaalin aktiivisen rivin tausta ei kohdennettu
LeftMarginActiveLineNumber=Vasemman marginaalin aktiivinen rivinumero 
LeftMarginBackground=Vasemman marginaalin tausta
LeftMarginBookmarkPanel=Vasemman marginaalin kirjanmerkin tausta
LeftMarginBorder=Vasemman marginaalin reuna
LeftMarginLineNumberLine=Vasemman marginaalin rivinumeron viiva
LeftMarginLineNumbers=Vasemman marginaalin rivinumerot
LeftMarginLineStateModified=Vasemman marginaalin rivin tila muokattus
LeftMarginLineStateNormal=Vasemman marginaalin rivin tila normaali
MatchingPairMatched=Vastaavat parit - osumat
MatchingPairUnmatched=Vastaavat parit - hudit
MinimapBackground=Minikartan tausta
MinimapBookmark=Minikartan kirjanmerkki
MinimapVisibleLines=Minikartan näkyvät rivit
RightMargin=Oikea marginaali
RightMovingEdge=Oikean marginaalin liikkuva reuna
RulerBackground=Viivaimen tausta
RulerBorder=Viivaimen reuna
RulerLines=Viivaimen viivat
RulerMovingEdge=Viivaimen liikkuva reuna
RulerNumbers=Viivaimen numerot
RulerSelection=Viivaimen valinta
SearchHighlighterBackground=Hakukorostuksen tausta
SearchHighlighterBorder=Hakukorostuksen reuna
SearchHighlighterForeground=Hakukorostuksen teksti
SearchInSelectionBackground=Valinnasta haun tausta
SearchMapActiveLine=Hakukartan aktiivinen viiva
SearchMapBackground=Hakukartan tausta
SearchMapForeground=Hakukartan teksti
SelectionBackground=Valinnan tausta
SelectionForeground=Valinnan teksti
SyncEditBackground=Synkronoidun muokkauksen tausta
SyncEditEditBorder=Synkronoidun muokkauksen reuna
SyncEditWordBorder=Synkronoidun muokkauksen sanan reuna
WordWrapIndicatorArrow=Rivityksen merkkinuoli
WordWrapIndicatorLines=Rivityksen merkkiviiva

[ErrorMessage]
DefaultEmailProgramNotFound=Ei löydy ohjelmaa sähköpostin lähettämiseen
DirectoryNotExist=Hakemistoa "%s" ei löydy
EnterFilename=Anna tiedoston nimi.
EnterKeyword=Anna avainsana.
EnterPath=Anna polku.
EnterServer=Anna palvelin.
EnterTabName=Anna välilehdelle nimi.
FileNotFound=Tiedostoa "%s" ei löydy.
RootDirectoryNotExist=Juurihakemistoa ei ole olemassa.

[ExecuteDialog]
ActionDelete:h=Poista kohde
ActionDelete=Poista
ActionEdit:h=Muokkaa kohdetta
ActionEdit=Muokkaa
ActionInsert:h=Lisää kohde
ActionInsert=Lisää
ActionMoveDown:h=Siirrä valittu kohde alas
ActionMoveDown=Siirrä alas
ActionMoveUp:h=Siirrä valittu kohde ylös
ActionMoveUp=Siirrä ylös
ActionSort:h=Järjestä kohteet
ActionSort=Järjestä
Caption=Suorita kohteita

[ExecuteEditDialog]
Caption=Suorita kohde
CheckBoxSaveActiveFile=Tallenna aktiivinen tiedosto 
CheckBoxShowOutput=Näytä tulos
ComboBoxShortcut=Pikavalinta
EditFilename=Tiedosto
EditParameters=Parametrit
EditTitle=Otsikko
EditWorkingDirectory=Työhakemisto

[FilesSelectDialog]
ActionSelectAll:h=Valitse kaikki tiedostot
ActionSelectAll=Valitse kaikki
ActionUnselectAll:h=Poista kaikki valinnat tiedostoista
ActionUnselectAll=Poista kaikki valinnat
Caption=Valitse tiedostot
VirtualDrawTree:0=Tiedosto
VirtualDrawTree:1=Polku

[FileTypes]
7Zip=7-Zip -tiedostot (*.7z)|*.7z
ABAP=ABAP -tiedostot (*.abap)
ActionScript=ActionScript -tiedostot (*.as)
ASP=ASP -tiedostot (*.asp)
Assembler - 6502=6502 Assembler -tiedostot (*.asm)
Assembler - 68HC11=68HC11 Assembler -tiedostot (*.hc11;*.asc)
AutoHotkey=AutoHotkey -tiedostot (*.ahk)
AutoIt v3=AutoIt -tiedostot (*.au3)
AWK=AWK -skriptit (*.awk)
Bash=Bash -tiedostot (*.sh)
C#=C# -tiedostot (*.cs)
C++=C++ -tiedostot (*.cpp;*.hpp)
C=C -tiedostot (*.c;*.h)
Clojure=Clojure -tiedostot (*.clj;*.cljs;*.cljc;*.edn)
CoffeeScript=CoffeeScript -tiedostot (*.coffee)
CSS=Cascading Stylesheet -tiedostot (*.css)
D=D -tiedostot (*.d;*.di)
Dart=Dart -tiedostot (*.dart)
Delphi Form Module=Delphi Form Module -tiedostot (*.dfm)
Diff=Difference -tiedostot (*.diff)
DWScript=DWScript -tiedostot (*.dws)
Eiffel=Eiffel -tiedostot (*.e;*.es)
Elixir=Elixir -tiedostot (*.exs)
Elm=Elm -tiedostot (*.elm)
Erlang=Erlang -tiedostot (*.erl;*.hrl)
Euphoria=Euphoria -tiedostot (*.e;*.ex;*.exw;*.edb)
Exe=Exe -tiedostot (*.exe)|*.exe
F#=F# -tiedostot (*.fs)
Free Pascal=Free Pascal -tiedostot (*.pp)
FreeBASIC=FreeBASIC -tiedostot (*.bi;*.bas)
GDScript=GDScript -tiedostot (*.gd)
Git Ignore=Git Ignore -tiedostot (*.gitignore)
GLSL=GLSL -tiedostot (*.glsl)
Go=Go -tiedostot (*.go)
Gravity=Gravity -tiedostot (*.gravity)
Groovy=Groovy -tiedostot (*.groovy;*.gvy;*.gy;*.gsh)
HTML with Scripts=HTML -tiedostot (*.html;*.htm)
INI=INI -tiedostot (*.ini;*.lng)
Inno Setup=Inno Setup -tiedostot (*.iss)
Java=Java -tiedostot (*.java)
JavaScript=JavaScript -tiedostot (*.js)
JSON=JSON -tiedostot (*.json)
Julia=Julia -tiedostot (*.jl)
Kotlin=Kotlin -tiedostot (*.kt;*.kts)
Language=Kielitiedostot (*.lng)|*.lng
LaTex=LaTex -tiedostot (*.lat;*.tex;*.lex)
Lisp=Lisp -tiedostot (*.lisp)
Log file=Log -tiedostot (*.log)
Lua=Lua -tiedostot (*.lua)
Macro=Macro -tiedostot (*.mcr)|*.mcr
Markdown=Markdown -tiedostot (*.md)
MATLAB=MATLAB -tiedostot (*.matlab)
MIME=MIME -tiedostot (*.eml;*.mht)
MS-DOS Batch=MS-DOS Batch -tiedostot (*.bat;*.cmd)
MSI=MSI -tiedostot (*.msi)|*.msi
NSIS=NSIS -tiedostot (*.nsi)
Object Pascal=Pascal -tiedostot (*.pas;*.dpr;*.dpk)
Objective-C=Objective-C -tiedostot (*.m)
OCaml=OCaml -tiedostot (*.ml)
PDF=PDF -tiedostot (*.pdf)
Perl=Perl -tiedostot (*.pl;*.pm;*.cgi)
PHP=PHP -tiedostot (*.php;*.class;*.inc)
PowerShell=PowerShell -tiedostot (*.ps1)
Python=Python -tiedostot (*.py)
R=R -tiedostot (*.r;*.rdata;*.rds;*.rda)
Red=Red -tiedostot (*.red;*.reds)
Ruby=Ruby -tiedostot (*.rb;*.rbw)
Rust=Rust -tiedostot (*.rc)
Scala=Scala -tiedostot (*.scala)
SQL - Standard=SQL -tiedostot (*.sql)
Structured Text=Structured Text -tiedostot (*.st; *.iecst)
Swift=Swift -tiedostot (*.swift)
TclTk=Tcl/Tk -tiedostot (*.tcl)
Text=Tekstitiedostot (*.txt)
TypeScript=TypeScript -tiedostot (*.ts)
UnrealScript=UnrealScript -tiedostot (*.uc)
Visual Basic=Visual Basic -tiedostot (*.vb;*.bas)
Visual FoxPro=Visual FoxPro -tiedostot (*.pjx;*.prg)
VRCalc++=VRCalc++ -tiedostot (*.vrc;*.vrcm)
XML=XML -tiedostot (*.xml;*.xsd;*.csl;*.dtd;*.dproj;*.groupproj;*.opml;*.rdf;*.svg;*.wxs)
XSL=XSL -tiedostot (*.xsl;*.xslt)
YAML=YAML -tiedostot (*.yml)
Zip=Zip -tiedostot (*.zip)|*.zip

[FindDuplicatesDialog]
ActionDirectoryItems=Hakemistot...
ActionFileMaskItems=Tiedostosuodattimet...
Caption=Etsi kopioita
CheckBoxIgnoreBlanks=Ei välitetä tyhjistä merkeistä
CheckBoxIgnoreCase=Ei välitetä merkin koosta
CheckBoxIncludeSubdirectories=Sisällytä alihakemistot
CheckBoxScanHorizontally=Etsi vaakasuunnassa
CheckBoxScanVertically=Esti pystysuunnassa
ComboBoxDirectories=Hakemistot
ComboBoxFileMask=Tiedostosuodatin
GroupBoxOptions=Valinnat
GroupBoxSearch=Etsi
GroupBoxSearchDirectoryOptions=Etsi hakemistosta valinnat
RadioButtonSearchAllOpenFiles=Avoimista tiedostoista
RadioButtonSearchInDirectories=Hakemistoista
SpinEditMinimumBlockSize=Pienin lohkokoko
SpinEditMinimumCharacters=Merkkien vähimmäismäärä

[FindInFilesDialog]
ActionDirectoryItems=Hakemistot...
ActionFileMaskItems=Tiedostosuodattimet...
ActionSearchEngine=Valitse hakumoottori
ActionTextToFindItems=Etsi kohteet...
Caption=Etsi tiedostoista
CheckBoxDisplayResultsInSeparateTab=Näytä tulokset erillisellä välilehdellä
CheckBoxGroupResultsByFile=Ryhmittele tiedostonimen mukaan
CheckBoxIncludeSubdirectories=Sisällytä alihakemistot
CheckBoxMatchCase=Merkkikokoriippuvaisuus
CheckBoxShowOnlyResult=Näytä vain hakutulos
CheckBoxWholeWords=Kokonaiset sanat
ComboBoxDirectories:h=Useat hakemistot erotetaan puolipisteellä
ComboBoxDirectories=Hakemistot
ComboBoxFileMask=Tiedostosuodatin
ComboBoxTextToFind=Etsi
GroupBoxOptions=Valinnat
GroupBoxOutputOptions=Hakutulokset
GroupBoxSearch=Etsi
GroupBoxSearchDirectoryOptions=Hakemisto valinnat
RadioButtonSearchAllOpenFiles=Avoimista tiedostoista
RadioButtonSearchInCurrentFile=Nykyisestä tiedostosta
RadioButtonSearchInDirectories=Hakemistoista

[HighlighterColorElements]
AssemblerComment=Konekielen kommentti
AssemblerReservedWord=Konekielen varattu sana
Attribute=Atribuutti
Character=Merkki
Comment=Kommetti
Directive=Direktiivi
Editor=Editori
HexNumber=Heksanumero
HighlightedBlock=Korostettu kooste
HighlightedBlockSymbol=Korostettu koostesymboli
LogicalOperator=Looginen operaattori
Method=Metodi
MethodItalic=Metodi kursivoitu
MethodName=Metodin nimi
Number=Numero
ReservedWord=Varattu sana
String=Merkkijono
Symbol=Symboli
Value=Arvo
WebLink=Nettilinkki

[HighlighterFontElements]
CodeFoldingHint=Koodin taiton vinkki
CompletionProposal=Täydennysehdotus
LineNumbers=Rivin numerot
Minimap=Minikartta
Ruler=Viivain
Text=Teksti

[InformationDialog]
Caption=Tietoja
LabelAccessed=Näytetty
LabelCharacterCount=Merkkilukumäärä
LabelCreated=Luotu
LabelFilename=Tiedoston nimi
LabelLength=Pituus
LabelLineCount=Rivilukumäärä
LabelLocation=Sijainti
LabelModified=Muokattu
LabelSize=Koko
LabelSizeOnDisk=Koko levyllä
LabelWordCount=Sanalukumäärä

[Buttons]
ButtonCancel=Peruuta
ButtonDonations=Lahjoitukset
ButtonDownloadAllSkins=Lataa kaikki teemat
ButtonLicense=Lisenssi...
ButtonNo=&Ei
ButtonOK=OK
ButtonYes=&Kyllä
ButtonYesToAll=Kyllä k&aikkiin

[ItemListDialog]
ActionClearAll:h=Tyhjennä kaikki kohteet
ActionClearAll=Tyhjennä kaikki
ActionDelete:h=Poista kohde
ActionDelete=Poista
ActionInsert:h=Lisää kohde
ActionInsert=Lisää
ActionMoveDown:h=Siirrä valittu kohde alas
ActionMoveDown=Siirrä alas
ActionMoveUp:h=Siirrä valittu kohde ylös
ActionMoveUp=Siirrä ylös
ActionSort:h=Järjestä kohteet
ActionSort=Järjestä

[LanguageEditorForm]
ActionExit:h=Sulje kielieditori
ActionExit=Sulje
ActionFileNew:h=Luo uusi kielitiedosto
ActionFileNew=Uusi
ActionFileOpen:h=Avaa olemassa oleva kielitiedosto
ActionFileOpen=Avaa
ActionFileSave:h=Tallenna kielitiedosto
ActionFileSave=Tallenna
VirtualDrawTree:0=Kohde
VirtualDrawTree:1=Otsikko
VirtualDrawTree:2=Vihje
VirtualDrawTree:3=Pikanäppäin
VirtualDrawTree:4=Toissijainen pikanäppäin

[MainForm]
ActionBookmarkListShowFilters=Näytä suodattimet 
ActionDirectoryContextMenu:h=Kontekstivalikko
ActionDirectoryContextMenu=&Kontekstivalikko
ActionDirectoryDelete:h=Poista tiedosto tai hakemisto
ActionDirectoryDelete=&Poista
ActionDirectoryFileExplorer:h=Avaa tiedostonhallinta
ActionDirectoryFileExplorer=Tiedostonhallinta
ActionDirectoryFindInFiles:h=Etsi merkkijonoa tiedostoista
ActionDirectoryFindInFiles=Etsi tiedostoista...
ActionDirectoryNewFolder=Uusi hakemisto
ActionDirectoryOpenAllFiles:h=Avaa kaikki hakemiston tiedostot
ActionDirectoryOpenAllFiles=Avaa kaikki tiedostot
ActionDirectoryOpenFileExplorer:h=Avaa tiedostonhallinta
ActionDirectoryOpenFileExplorer=Tiedostonhallinta
ActionDirectoryProperties:h=Katso tiedoston/hakemiston ominaisuudet
ActionDirectoryProperties=&Ominaisuudet...
ActionDirectoryRefresh:h=Päivitä tiedostot
ActionDirectoryRefresh=&Päivitä
ActionDirectoryRename:h=Nimeä tiedosto tai hakemisto uudelleen
ActionDirectoryRename=&Nimeä uudelleen
ActionDirectorySFTPDownload=Lataa
ActionDirectorySFTPUpload=Lähetä
ActionEdit=&Muokkaa
ActionEditCopy:h=Kopioi valinta ja aseta se leikepöydälle
ActionEditCopy:s=Ctrl+C
ActionEditCopy=&Kopioi
ActionEditCopyWithLineNumbers:h=Kopioi valinta ja aseta se leikepöydälle
ActionEditCopyWithLineNumbers:s=Ctrl+Alt+C
ActionEditCopyWithLineNumbers=Kopioi rivinumeroiden kera
ActionEditCut:h=Leikkaa valinta ja aseta se leikepöydälle
ActionEditCut:s=Ctrl+X
ActionEditCut=&Leikkaa
ActionEditDecode:h=Dekoodaa
ActionEditDecode=Dekoodaa
ActionEditDecodeASCIIDecimal:h=Dekoodaa ASCII desimaali
ActionEditDecodeASCIIDecimal=ASCII desimaali
ActionEditDecodeBase1024:h=Dekoodaa base1024
ActionEditDecodeBase1024=1024
ActionEditDecodeBase128:h=Dekoodaa base128
ActionEditDecodeBase128=128
ActionEditDecodeBase256:h=Dekoodaa base256
ActionEditDecodeBase256=256
ActionEditDecodeBase32:h=Dekoodaa base32
ActionEditDecodeBase32=32
ActionEditDecodeBase4096:h=Dekoodaa base4096
ActionEditDecodeBase4096=4096
ActionEditDecodeBase64:h=Dekoodaa base64
ActionEditDecodeBase64=64
ActionEditDecodeBase85:h=Dekoodaa base85
ActionEditDecodeBase85=85
ActionEditDecodeBase91:h=Dekoodaa base91
ActionEditDecodeBase91=91
ActionEditDecodeBase:h=Dekoodaa base
ActionEditDecodeBase=Base
ActionEditDecodeBinary:h=Dekoodaa binääri
ActionEditDecodeBinary=Binääri
ActionEditDecodeHex:h=Dekoodaa heksa
ActionEditDecodeHex=Heksa
ActionEditDecodeHexWithoutSpaces:h=Dekoodaa heksa ilman välilyöntejä
ActionEditDecodeHexWithoutSpaces=Heksa (ilman välilyöntejä)
ActionEditDecodeHTML:h=Dekoodaa HTML
ActionEditDecodeHTML=HTML
ActionEditDecodeOctal:h=Dekoodaa oktaali
ActionEditDecodeOctal=Oktaali
ActionEditDecodeRotate13:h=Kierrä 13 merkkiä
ActionEditDecodeRotate18:h=Kierrä 18 merkkiä
ActionEditDecodeRotate47:h=Kierrä 47 merkkiä
ActionEditDecodeRotate5:h=Kierrä 5 merkkiä
ActionEditDecodeRotate:h=Dekoodaa kierto
ActionEditDecodeRotate=Kierto
ActionEditDecodeURL:h=Dekoodaa URL
ActionEditDecodeURL=URL
ActionEditDelete=P&oista
ActionEditDeleteBeginningOfLine:h=Poista rivin alku
ActionEditDeleteBeginningOfLine:s=Shift+Ctrl+T
ActionEditDeleteBeginningOfLine=Rivin alku
ActionEditDeleteCharForward:h=Poista merkki eteenpäin
ActionEditDeleteCharForward:s=Shift+BkSp
ActionEditDeleteCharForward=Merkki eteenpäin 
ActionEditDeleteComments:h=Poista kommentit
ActionEditDeleteComments=Kommentit
ActionEditDeleteDuplicateLines:h=Poista kaksoiskappalerivit
ActionEditDeleteDuplicateLines=Kaksoiskappalerivit
ActionEditDeleteEndOfLine:h=Poista rivin loppu
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=R&ivin loppu
ActionEditDeleteLine:h=Poista rivi
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&Rivi
ActionEditDeleteWhitespace:h=Poista kaikki välilyönnit valitusta tekstistä
ActionEditDeleteWhitespace=Välilyönnit
ActionEditDeleteWord:h=Poista sana
ActionEditDeleteWord:s=Ctrl+W
ActionEditDeleteWord=&Sana
ActionEditDeleteWordBackward:h=Poista sana taaksepäin
ActionEditDeleteWordBackward:s=Ctrl+BkSp
ActionEditDeleteWordBackward=Sana taaksepäin
ActionEditDeleteWordForward:h=Poista sana eteenpäin
ActionEditDeleteWordForward:s=Ctrl+Del
ActionEditDeleteWordForward=Sana eteenpäin
ActionEditEncode:h=Koodaa
ActionEditEncode=Koodaa
ActionEditEncodeASCIIDecimal:h=Koodaa ASCII desimaali
ActionEditEncodeASCIIDecimal=ASCII desimaali
ActionEditEncodeBase1024:h=Koodaa base1024
ActionEditEncodeBase1024=1024
ActionEditEncodeBase128:h=Koodaa base128
ActionEditEncodeBase128=128
ActionEditEncodeBase256:h=Koodaa base256
ActionEditEncodeBase256=256
ActionEditEncodeBase32:h=Koodaa base32
ActionEditEncodeBase32=32
ActionEditEncodeBase4096:h=Koodaa base4096
ActionEditEncodeBase4096=4096
ActionEditEncodeBase64:h=Koodaa base64
ActionEditEncodeBase64=64
ActionEditEncodeBase64WithLineBreaks:h=Koodaa base64 rivinvaihdoilla
ActionEditEncodeBase64WithLineBreaks=64 (rivinvaihdoilla)
ActionEditEncodeBase85:h=Koodaa base85
ActionEditEncodeBase85=85
ActionEditEncodeBase91:h=Koodaa base91
ActionEditEncodeBase91=91
ActionEditEncodeBase:h=Koodaa base
ActionEditEncodeBase=Base
ActionEditEncodeBinary:h=Koodaa binääri
ActionEditEncodeBinary=Binääri
ActionEditEncodeHex:h=Koodaa heksa
ActionEditEncodeHex=Heksa
ActionEditEncodeHexWithoutSpaces:h=Koodaa heksa ilman välilyöntejä
ActionEditEncodeHexWithoutSpaces=Heksa (ilman välilyöntejä)
ActionEditEncodeHTML:h=Koodaa HTML
ActionEditEncodeHTML=HTML
ActionEditEncodeOctal:h=Koodaa oktaali
ActionEditEncodeOctal=Oktaali
ActionEditEncodeRotate13:h=Kierrä 13 merkkiä
ActionEditEncodeRotate18:h=Kierrä 18 merkkiä
ActionEditEncodeRotate47:h=Kierrä 47 merkkiä
ActionEditEncodeRotate5:h=Kierrä 5 merkkiä
ActionEditEncodeRotate:h=Koodaa kierto
ActionEditEncodeRotate=Kierto
ActionEditEncodeURL:h=Koodaa URL
ActionEditEncodeURL=URL
ActionEditFormatJSON=Muotoile JSON
ActionEditFormatJSONIndent2:h=Muotoile JSON
ActionEditFormatJSONIndent2:s=Ctrl+Shift+J
ActionEditFormatJSONIndent2=Sisennä 2
ActionEditFormatJSONIndent3=Sisennä 3
ActionEditFormatJSONIndent4=Sisennä 4
ActionEditFormatJSONMinify=Pakkaa
ActionEditFormatSQL:h=Muotoile SQL
ActionEditFormatSQL=Muotoile SQL
ActionEditFormatXML=Muotoile XML
ActionEditFormatXMLFormat:h=Muotoile XML
ActionEditFormatXMLFormat:s=Ctrl+Shift+X
ActionEditFormatXMLFormat=Muotoile
ActionEditFormatXMLMinify=Pakkaa
ActionEditIndentDecrease:h=Vähennä sisennystä
ActionEditIndentDecrease:s=Shift+Ctrl+U
ActionEditIndentDecrease=&Vähennä sisennystä
ActionEditIndentIncrease:h=Kasvata sisennystä
ActionEditIndentIncrease:s=Shift+Ctrl+I
ActionEditIndentIncrease=Kasvata sisennystä
ActionEditInsert=Lisää
ActionEditInsertBlockComment:h=Vaihda lohkokommentti. Pikanäppäin on Ctrl+Shift+VK_OEM_2. Virtuaalinäppäin VK_OEM_2 vaihtelee näppäimistöittäin. US standardin näppäimistössä se on '/?' näppäin.
ActionEditInsertBlockComment=Lohkokommentti
ActionEditInsertDateTime:h=Lisää päivämäärä ja aika
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&Päivämäärä ja aika
ActionEditInsertGUID:h=Lisää GUID
ActionEditInsertGUID:s=Shift+Ctrl+G
ActionEditInsertGUID=GUID
ActionEditInsertHexColor:h=Väri (heksa)
ActionEditInsertHexColor:s=Shift+Alt+C
ActionEditInsertHexColor=Väri (heksa)
ActionEditInsertLine:h=Lisää rivi
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=&Rivi
ActionEditInsertLineComment:h=Vaihda rivikommentti. Pikanäppäin on Ctrl+VK_OEM_2. Virtuaalinäppäin VK_OEM_2 vaihtelee näppäimistöittäin. US standardin näppäimistössä se on '/?' näppäin.
ActionEditInsertLineComment=Rivikommentti
ActionEditInsertNull:h=Lisää tyhjä merkki
ActionEditInsertNull:s=Shift+Ctrl+N
ActionEditInsertNull=Tyhjä
ActionEditInsertTag:h=Lisää HTML/XML tagit
ActionEditInsertTag:s=Ctrl+T
ActionEditInsertTag=&HTML/XML tagit...
ActionEditModify=Muokkaa
ActionEditModifyJoin:h=Liitä teksti välimerkillä
ActionEditModifyJoin=Liitä
ActionEditModifyLineWrap:h=Rivitä rivit pituuden mukaan
ActionEditModifyLineWrap=Rivin rivitys
ActionEditModifySpacesToTabs:h=Muuta kaikki välilyönnit tabulaattoreiksi
ActionEditModifySpacesToTabs=välilyönnit tabulaattoreiksi
ActionEditModifySplit:h=Jaa teksti välimerkillä
ActionEditModifySplit=Jaa
ActionEditModifyTabsToSpaces:h=Muuta kaikki tabulaattorit välilyönneiksi
ActionEditModifyTabsToSpaces=Tabulaattorit välilyönneiksi
ActionEditMove=Siirrä
ActionEditMoveLineDown:h=Siirrä rivi alaspäin
ActionEditMoveLineDown:s=Shift+Ctrl+Down
ActionEditMoveLineDown=Rivi alaspäin
ActionEditMoveLineUp:h=Siirrä rivi ylöspäin
ActionEditMoveLineUp:s=Shift+Ctrl+Up
ActionEditMoveLineUp=Rivi ylöspäin
ActionEditMoveNextWord:h=Siirry seuraavaan sanaan
ActionEditMoveNextWord:s=Ctrl+Right
ActionEditMoveNextWord=Seuraava sana
ActionEditMovePreviousWord:h=Siirry edelliseen sanaan
ActionEditMovePreviousWord:s=Ctrl+Left
ActionEditMovePreviousWord=Edellinen sana
ActionEditMoveSelectionDown:h=Siirrä valittua alaspäin
ActionEditMoveSelectionDown:s=Shift+Alt+Down
ActionEditMoveSelectionDown=Valittua alaspäin
ActionEditMoveSelectionLeft:h=Siirrä valittua vasemmalle
ActionEditMoveSelectionLeft:s=Shift+Alt+Left
ActionEditMoveSelectionLeft=Valittua vasemmalle
ActionEditMoveSelectionRight:h=Siirrä valittua oikealle
ActionEditMoveSelectionRight:s=Shift+Alt+Right
ActionEditMoveSelectionRight=Valittua oikealle
ActionEditMoveSelectionUp:h=Siirrä valittua ylöspäin
ActionEditMoveSelectionUp:s=Shift+Alt+Up
ActionEditMoveSelectionUp=Valittua ylöspäin
ActionEditPaste:h=Liitä leikepöydän sisältö
ActionEditPaste:s=Ctrl+V
ActionEditPaste=&Liitä
ActionEditRedo:h=Toista viimeksi peruttu toiminto
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=&Toista
ActionEditSelectAll:h=Valitse kaikki
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=&Valitse kaikki
ActionEditSort=&Järjestys
ActionEditSortAsc:h=Lajittele nousevasti
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&Nousevasti
ActionEditSortDesc:h=Lajittele laskevasti
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&Laskevasti
ActionEditSortRandom:h=Satunnainen järjestys
ActionEditSortRandom=Satunnaisesti
ActionEditToggleCase:h=Vaihda kirjainkokoa
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=Vaihda kirjainkokoa
ActionEditToggleCaseAlternating:h=Vaihda kirjainkokoa
ActionEditToggleCaseAlternating=Vaihto
ActionEditToggleCaseLower:h=Vaihda kirjainkoko pieneksi
ActionEditToggleCaseLower:s=Ctrl+L
ActionEditToggleCaseLower=Pienet
ActionEditToggleCaseSentence:h=Vaihda kirjainkoko lauseeksi
ActionEditToggleCaseSentence=Lause
ActionEditToggleCaseTitle:h=Vaihda kirjainkoko otsikoksi
ActionEditToggleCaseTitle=Otsikko
ActionEditToggleCaseUpper:h=Vaihda kirjainkoko isoksi
ActionEditToggleCaseUpper:s=Ctrl+U
ActionEditToggleCaseUpper=Isot
ActionEditTrim=Trimmaus
ActionEditTrimBoth:h=Trimmaa vasen ja oikea
ActionEditTrimBoth=Molemmat
ActionEditTrimLeft:h=Trimmaa vasen
ActionEditTrimLeft=Vasen
ActionEditTrimRight:h=Trimmaa oikea
ActionEditTrimRight=Oikea
ActionEditUndo:h=Peru viimeisin toiminto
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=&Peru
ActionEditValidateXML=Validoi XML
ActionFile=&Tiedosto
ActionFileAddToFavourites:h=Lisää tiedosto suosikkeihin
ActionFileAddToFavourites:s=Ctrl+D
ActionFileAddToFavourites=Lisää suosikkeihin
ActionFileCanClose:h=Vaihda, voidaanko välilehti sulkea tai ei
ActionFileCanClose=Voi sulkea
ActionFileClose=&Sulje
ActionFileCloseActive:h=Sulje aktiivinen tiedosto
ActionFileCloseActive:s=Ctrl+F4
ActionFileCloseActive=Aktiivinen
ActionFileCloseAll:h=Sulje kaikki avoimet tiedostot
ActionFileCloseAll=&Kaikki
ActionFileCloseAllOther:h=Sulje kaikki muut sivut
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=Kaikki muut
ActionFileCloseModified:h=Sulje muokatut tiedostot
ActionFileCloseModified=Muokatut
ActionFileCloseSelected:h=Sulje valitut tiedostot
ActionFileCloseSelected=Valitut
ActionFileCloseUnmodified:h=Sulje muokkaamattomat tiedostot
ActionFileCloseUnmodified=Muokkaamattomat
ActionFileContextMenu:h=Kontekstivalikko
ActionFileContextMenu=&Kontekstivalikko
ActionFileExit:h=Sulj&e sovellus
ActionFileExit:s2=ESC
ActionFileExit:s=Alt+F4
ActionFileExit=L&opeta
ActionFileFavourites=Suosikit
ActionFileFavouritesProperties=Ominaisuudet...
ActionFileHTMLExport=HTML -vienti
ActionFileInfo:h=Tietoja aktiivisesta tiedostosta
ActionFileInfo=&Tietoja...
ActionFileMoveCaretAtTheEndAfterReload:h=Vaihda editorin siirrä kohdistin loppuun uudelleen latauksen jälkeen -valinta
ActionFileMoveCaretAtTheEndAfterReload=Siirrä kohdistin loppuun uudelleen latauksen jälkeen
ActionFileNew:h=Luo uusi tiedosto
ActionFileNew:s=Ctrl+N
ActionFileNew=&Uusi
ActionFileOpen:h=Avaa tiedosto
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&Avaa...
ActionFileOpenCommandPrompt:h=Avaa komentokehoite
ActionFileOpenCommandPrompt=Komentokehoite
ActionFileOpenFileExplorer:h=Avaa tiedostonhallinta
ActionFileOpenFileExplorer=Tiedostonhallinta
ActionFileOpenInBrowser:h=Avaa nykyinen tiedosto oletus selaimessa
ActionFileOpenInBrowser:s=Alt+B
ActionFileOpenInBrowser=&Selain
ActionFilePrint:h=Tul&osta aktiivinen tiedosto
ActionFilePrint:s=Ctrl+P
ActionFilePrint=T&ulosta...
ActionFilePrintPreview:h=Esikatsele aktiivinen tiedosto
ActionFilePrintPreview=E&sikatselu...
ActionFileProperties:h=Katso tiedoston ominaisuudet
ActionFileProperties=&Ominaisuudet...
ActionFileReadOnly:h=Vaihda editori ainoastaan luettavaksi
ActionFileReadOnly=Lue ainoastaan
ActionFileReloadAutomatically:h=Vaihda editorin lataus automaattisesti
ActionFileReloadAutomatically=Lataa automaattisesti
ActionFileRemoveFromFavourites=Poista suosikeista
ActionFileRenameTab=Uudelleen nimeä välilehti
ActionFileReopen=A&vaa uudelleen
ActionFileReopenProperties=Ominaisuudet...
ActionFileSave:h=Tallenna aktiivinen tiedosto
ActionFileSave:s=Ctrl+S
ActionFileSave=Tallenna
ActionFileSaveAll:h=Tallenna kaikki tiedostot3
ActionFileSaveAll:s=Shift+Ctrl+S
ActionFileSaveAll=Tall&enna kaikki
ActionFileSaveAs:h=Tallenna aktiivinen tiedosto uudella nimellä
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=Ta&llenna nimellä...
ActionFileSelectFromDirectory:h=Valitse tiedosto aktiivisesta hakemistosta
ActionFileSelectFromDirectory=Valitse hakemistosta
ActionFileTrimTrailingSpaces:h=Vaihda editorin trimmaa lopussa olevat välilyönnit
ActionFileTrimTrailingSpaces=Trimmaa lopussa olevat välilyönnit
ActionFileUpload=Lähetä
ActionGotoNextBookmark:h=Mene seuraavaan kirjanmerkkiin
ActionGotoNextBookmark:s=F2
ActionGotoNextBookmark=Seuraava
ActionGotoPreviousBookmark:h=Mene edelliseen kirjanmerkkiin
ActionGotoPreviousBookmark:s=Shift+F2
ActionGotoPreviousBookmark=Edellinen
ActionHelp=&Ohje
ActionHelpAboutTextEditorPro:h=Näytä tietoja ohjelmasta
ActionHelpAboutTextEditorPro=&Tietoja ohjelmasta
ActionHelpCheckForUpdates:h=Tarkasta päivitykset
ActionHelpCheckForUpdates=&Tarkasta päivitykset
ActionHelpSendFeedback:h=Lähetä palautetta sähköpostiosoitteeseen info@texteditor.pro
ActionHelpSendFeedback=Lähetä palautetta
ActionHelpShortcuts:h=Näytä pikanäppäimet
ActionHelpShortcuts:s=Ctrl+F1
ActionHelpShortcuts=Pikanäppäimet
ActionHelpVisitHomepage:h=Vieroile Text Editor Pron kotisivuilla - https://texteditor.pro
ActionHelpVisitHomepage=&Vieraile kotisivuilla
ActionImageViewRotateClockwise:h=Käännä sivua myötäpäivään 
ActionImageViewRotateCounterClockwise:h=Käännä sivua vastapäivään
ActionImageViewZoomIn:h=Lähennä
ActionImageViewZoomOut:h=Loitonna
ActionMenuEdit:h=Vaihda muokkaa välilehdelle
ActionMenuFile:h=Vaihda tiedosto välilehdelle
ActionMenuHelp:h=Vaihda ohje välilehdelle
ActionMenuSearch:h=Vaihda etsi välilehdelle
ActionMenuTools:h=Vaihda työkalut välilehdelle
ActionMenuView:h=Vaihda näytä välilehdelle
ActionOpenColorTheme:h=Avaa otsikkopalkin väriteemavalikko
ActionOpenColorTheme:s=Alt+F11
ActionOpenColorTheme=Väriteema
ActionOpenEncoding:h=Avaa otsikkopalkin koodausvalikko
ActionOpenEncoding:s=Alt+F9
ActionOpenEncoding=Koodaus
ActionOpenFileList:h=Avaa otsikkopalkin tiedostolista
ActionOpenFileList:s=Alt+F12
ActionOpenFileList=Tiedostot
ActionOpenHighlighter:h=Avaa otsikkopalkin korostusvalikko
ActionOpenHighlighter:s=Alt+F10
ActionOpenHighlighter=Korostus
ActionOutputClose=&Sulje
ActionOutputCloseActive:h=Sulje aktiivinen sivu
ActionOutputCloseActive=Aktiivinen
ActionOutputCloseAll:h=Sulje kaikki sivut
ActionOutputCloseAll=Kaikki
ActionOutputCloseAllOtherPages:h=Sulje kaikki muut
ActionOutputCloseAllOtherPages=Kaikki &muut sivut
ActionOutputCloseSelected:h=Sulje valitut sivut
ActionOutputCloseSelected=Valitut
ActionOutputCollapseAll:h=Taita kokoon kaikki solmut
ActionOutputCollapseAll=Taita kokoon kaikki solmut
ActionOutputCopyAllToClipboard:h=Kopioi kaikki leikepöydälle
ActionOutputCopyAllToClipboard=&Kopioi kaikki leikepöydälle
ActionOutputCopySelectedToClipboard:h=Kopioi valitut leikepöydälle
ActionOutputCopySelectedToClipboard=Kopioi valitut leikepöydälle
ActionOutputExpandAll:h=Laajenna kaikki solmut
ActionOutputExpandAll=Laajenna kaikki solmut
ActionOutputOpenAll:h=Avaa kaikki tiedostot
ActionOutputOpenAll=&Avaa kaikki
ActionOutputOpenSelected:h=Avaa valitut tiedostot
ActionOutputOpenSelected=&Avaa valitut
ActionOutputRefresh=Päivitä
ActionOutputSelectAll:h=Valitse kaikki tiedostot
ActionOutputSelectAll=Valitse kaikki
ActionOutputUnselectAll:h=Poista kaikki valinnat tiedostoista
ActionOutputUnselectAll=Poista kaikki valinnat
ActionPDFFindNext:h=Etsi seuraava
ActionPDFFindPrevious:h=Etsi edellinen
ActionPDFNextPage:h=Seuraava sivu
ActionPDFPreviousPage:h=Edellinen sivu
ActionPDFRotatePageClockwise:h=Käännä sivua myötäpäivään 
ActionPDFRotatePageCounterClockwise:h=Käännä sivua vastapäivään
ActionPDFSearchHighlightAll=Korosta kaikki
ActionPDFSearchMatchCase=Merkkikokoriippuvainen
ActionPDFSearchWholeWords=Kokonaiset sanat
ActionPDFZoomIn:h=Lähennä
ActionPDFZoomOut:h=Loitonna
ActionSearch=&Etsi
ActionSearchBookmarks:h=Näytä tai päivitä kaikki tallennetut kirjanmerkit
ActionSearchBookmarks=Kirjanmerkit
ActionSearchClearBookmarks:h=Poista kaikki kirjanmerkit
ActionSearchClearBookmarks=Poista &kirjanmerkit
ActionSearchClose:h=Sulje
ActionSearchEngine:h=Valitse hakukone
ActionSearchEngine=Hakukone
ActionSearchFindAll:h=Etsi kaikki samanlaiset tekstit
ActionSearchFindAll:s=Alt+Enter
ActionSearchFindAll=Etsi kaikki
ActionSearchFindDuplicates:h=Etsi kopioita
ActionSearchFindDuplicates=Etsi kopioita
ActionSearchFindInFiles:h=Etsi merkkijonoa tiedostoista
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=Etsi tiedostoista...
ActionSearchFindNext:h=Etsi seuraava samanlainen teksti
ActionSearchFindNext:s=F3
ActionSearchFindNext=Etsi seuraava
ActionSearchFindPrevious:h=Etsi edellinen samanlainen teksti
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=Etsi edellinen
ActionSearchGoToBookmarks:h=Mene kirjanmerkkeihin
ActionSearchGoToBookmarks=Mene kirjanmerkkeihin
ActionSearchGoToLine:h=Mene riville
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=Mene riville
ActionSearchInSelection:h=Valinnasta
ActionSearchInSelection=Valinnasta
ActionSearchMatchCase:h=Merkkikokoriippuvainen
ActionSearchMatchCase=Merkkikokoriippuvainen
ActionSearchOptions:h=Hakuasetukset
ActionSearchReplace:h=Korvaa määritetty teksti eri tekstillä
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&Korvaa...
ActionSearchSearchButton:h=Etsi määritetty teksti
ActionSearchSearchButton:s=Ctrl+F
ActionSearchSearchButton=&Etsi...
ActionSearchSpellCheck:h=Oikeinkirjoituksen tarkistus
ActionSearchSpellCheck:s=F6
ActionSearchSpellCheck=Oikeinkirjoittaja
ActionSearchSpellCheckNextError:h=Seuraava oikeinkirjoituksen tarkistusvirhe
ActionSearchSpellCheckNextError:s=Ctrl+F6
ActionSearchSpellCheckNextError=Seuraava virhe
ActionSearchSpellCheckPreviousError:h=Edellinen oikeinkirjoituksen tarkistusvirhe
ActionSearchSpellCheckPreviousError:s=Ctrl+Shift+F6
ActionSearchSpellCheckPreviousError=Edellinen virhe
ActionSearchTextItems:h=Haetut kohteet
ActionSearchTextItems=Haetut kohteet...
ActionSearchToggleBookmark:h=Aseta tai poista kirjanmerkki nykyiselle riville. Kirjanmerkit voidaan myös asettaa käyttämällä Ctrl+Shift+1..9. Siirry kirjanmerkkiin Ctrl+1..9 avulla.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=Vaihda kirjanmerkki
ActionSearchToggleBookmarks:h=Vaihda kirjanmerkkejä
ActionSearchToggleBookmarks=Vaihda kirjanmerkkejä
ActionSearchWholeWords:h=Kokonaiset sanat
ActionSearchWholeWords=Kokonaiset sanat
ActionStatusBarShowCaretPosition=Näytä kursorin sijainti
ActionStatusBarShowCharacterCount=Näytä merkkien määrä
ActionStatusBarShowEditorZoom=Näytä editorin zoomaus
ActionStatusBarShowEncoding=Näytä koodaus
ActionStatusBarShowFileLineBreak=Näytä tiedoston rivinvaihto 
ActionStatusBarShowFileOpeningTime=Näytä tiedoston avaamiseen kuluva aika
ActionStatusBarShowHints=Näytä vihjeet
ActionStatusBarShowKeyState=Näytä näppäintila
ActionStatusBarShowLineCount=Näytä rivimäärä
ActionStatusBarShowMacro=Näytä makro
ActionStatusBarShowModified=Näytä muokattu
ActionStatusBarShowSelectionInfo=Näytä valintatiedot
ActionStatusBarShowSizeGrip=Näytä koon ote
ActionToolbarMenuLanguage=Kieli
ActionToolbarMenuLayout=Asettelu
ActionToolbarMenuLayoutSingle=Yksi sarake
ActionToolbarMenuLayoutThreeColumns=Kolme saraketta
ActionToolbarMenuLayoutTwoColumns=Kaksi saraketta
ActionToolbarMenuView=Näkymä
ActionTools=T&yökalut
ActionToolsCharacterMap:h=Aseta merkki aktiiviseen tiedostoon tuplaklikkaamalla
ActionToolsCharacterMap=&Merkistö...
ActionToolsClipboardHistory:h=Leikepöydän historia
ActionToolsClipboardHistory=Leikepöydän historia
ActionToolsConvert:h=Muunna numeraalisten yksiköiden välillä
ActionToolsConvert=&Muunna...
ActionToolsExecute:h=Suorita omia ohjelmia
ActionToolsExecute=Suorita
ActionToolsExecuteConfigure:h=Määritä suoritettavien ohjelmien ominaisuuksia
ActionToolsExecuteConfigure=Määritä...
ActionToolsLanguageEditor:h=Kielieditori
ActionToolsLanguageEditor=&Kielieditori...
ActionToolsMacro=Makro
ActionToolsMacroOpen:h=Avaa makro
ActionToolsMacroOpen=&Avaa...
ActionToolsMacroPause:h=Tauota makro
ActionToolsMacroPause:s=Shift+Ctrl+R
ActionToolsMacroPause=&Tauota
ActionToolsMacroPlayback:h=Suorita makro
ActionToolsMacroPlayback:s=Shift+Ctrl+P
ActionToolsMacroPlayback=&Suorita
ActionToolsMacroRecord:h=Nauhoita makro
ActionToolsMacroRecord:s=Shift+Ctrl+R
ActionToolsMacroRecord=&Nauhoita
ActionToolsMacroSaveAs:h=Tallenna makro uudella nimellä
ActionToolsMacroSaveAs=&Tallenna nimellä...
ActionToolsMacroStop:h=Pysäytä makron nauhoitus
ActionToolsMacroStop:s=Shift+Ctrl+M
ActionToolsMacroStop=&Pysäytä
ActionToolsMagnifier:h=Suurennuslasi
ActionToolsMagnifier=Suurennuslasi
ActionToolsMagnifierBorderStyle:h=Reunan tyyli
ActionToolsMagnifierBorderStyle=Reunan tyyli
ActionToolsMagnifierBorderStyleDefault:h=Oletus reunan tyyli
ActionToolsMagnifierBorderStyleDefault=Oletus
ActionToolsMagnifierBorderStyleFlat:h=Litteä reunan tyyli
ActionToolsMagnifierBorderStyleFlat=Litteä
ActionToolsMagnifierBorderStyleNone:h=Ei reunaa
ActionToolsMagnifierBorderStyleNone=Ei reunaa
ActionToolsMagnifierClose:h=Sulje suurennuslasi
ActionToolsMagnifierClose:s=Ctrl+Esc
ActionToolsMagnifierClose=Sulje
ActionToolsMagnifierScaling16x:h=Kuusitoistakertainen skaalaus
ActionToolsMagnifierScaling16x=16x
ActionToolsMagnifierScaling2x:h=Kaksinkertainen skaalaus
ActionToolsMagnifierScaling2x=2x
ActionToolsMagnifierScaling4x:h=Nelinkertainen skaalaus
ActionToolsMagnifierScaling4x=4x
ActionToolsMagnifierScaling8x:h=Kahdeksankertainen skaalaus
ActionToolsMagnifierScaling8x=8x
ActionToolsMagnifierScaling:h=Skaalaus
ActionToolsMagnifierScaling=Skaalaus
ActionToolsMagnifierStyle:h=Tyyli
ActionToolsMagnifierStyle=Tyyli
ActionToolsMagnifierStyleLens:h=Tyyli: linssi
ActionToolsMagnifierStyleLens=Linssi
ActionToolsMagnifierStyleRectangle:h=Tyyli: suorakulmio
ActionToolsMagnifierStyleRectangle=Suorakulmio
ActionToolsOptions:h=Asetukset
ActionToolsOptions=&Asetukset...
ActionToolsPauseSpeaking:h=Keskeytä puhuminen
ActionToolsPauseSpeaking=Keskeytä puhuminen
ActionToolsSelectForTextCompare:h=Valitse tiedosto tekstivertailuun
ActionToolsSelectForTextCompare=Valitse tekstivertailuun...
ActionToolsSpeech=Puhe
ActionToolsStartSpeaking:h=Aloita puhuminen
ActionToolsStartSpeaking=Aloita puhuminen
ActionToolsStopSpeaking:h=Lopeta puhuminen
ActionToolsStopSpeaking=Lopeta puhuminen
ActionToolsTextCompare:h=Vertaa tekstitiedostoja
ActionToolsTextCompare=&Vertaa tekstitiedostoja...
ActionView=&Näytä
ActionViewBookmarkList:h=Näytä tai piilota kirjanmerkkiluettelo 
ActionViewBookmarkList=Kirjanmerkkiluettelo
ActionViewColorThemeSelection:h=Näytä tai piilota väriteeman valinta
ActionViewColorThemeSelection=Väriteema
ActionViewDirectory=Hakemisto
ActionViewDirectoryClose:h=Sulje aktiivinen hakemisto
ActionViewDirectoryClose:s=Shift+Alt+X
ActionViewDirectoryClose=&Sulje
ActionViewDirectoryEdit:h=Muokkaa aktiivista hakemistoa
ActionViewDirectoryEdit:s=Shift+Ctrl+E
ActionViewDirectoryEdit=&Muokkaa...
ActionViewDirectoryOpen:h=Avaa uusi hakemisto
ActionViewDirectoryOpen:s=Ctrl+Alt+D
ActionViewDirectoryOpen=&Avaa...
ActionViewDirectoryVisibility:h=Näytä tai piilota hakemisto
ActionViewDirectoryVisibility=&Hakemisto
ActionViewEncodingSelection:h=Näytä tai piilota koodauksen valinta
ActionViewEncodingSelection=K&oodaus
ActionViewFiles:h=Etsi tiedostoja valitusta hakemistopolusta ja sen alihakemistoista
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&Tiedostot...
ActionViewFolding=Taitto
ActionViewFoldingCollapse=Taita
ActionViewFoldingCollapseAll:h=Taita kaikki
ActionViewFoldingCollapseAll=Taita kaikki
ActionViewFoldingCollapseAllDownFromActiveLine:h=Taita kaikki alaspäin aktiiviselta riviltä
ActionViewFoldingCollapseAllDownFromActiveLine=Taita kaikki alaspäin aktiiviselta riviltä
ActionViewFoldingCollapseAllUpFromActiveLine:h=Taita kaikki ylöspäin aktiiviselta riviltä
ActionViewFoldingCollapseAllUpFromActiveLine=Taita kaikki ylöspäin aktiiviselta riviltä
ActionViewFoldingCollapseLine:h=Taita rivi
ActionViewFoldingCollapseLine:s=Ctrl+Alt+Left
ActionViewFoldingCollapseLine=Taita rivi
ActionViewFoldingExpand=Avaa
ActionViewFoldingExpandAll:h=Avaa kaikki
ActionViewFoldingExpandAll=Avaa kaikki
ActionViewFoldingExpandAllDownFromActiveLine:h=Avaa kaikki alaspäin aktiiviselta riviltä
ActionViewFoldingExpandAllDownFromActiveLine=Avaa kaikki alaspäin aktiiviselta riviltä
ActionViewFoldingExpandAllUpFromActiveLine:h=Avaa kaikki ylöspäin aktiiviselta riviltä
ActionViewFoldingExpandAllUpFromActiveLine=Avaa kaikki ylöspäin aktiiviselta riviltä
ActionViewFoldingExpandLine:h=Avaa rivi
ActionViewFoldingExpandLine:s=Ctrl+Alt+Right
ActionViewFoldingExpandLine=Avaa rivi
ActionViewFoldingNext:h=Siirry seuraavaan taitokseen
ActionViewFoldingNext:s=Ctrl+Alt+Down
ActionViewFoldingNext=Seuraava
ActionViewFoldingPrevious:h=Siirry edelliseen taitokseen
ActionViewFoldingPrevious:s=Ctrl+Alt+Up
ActionViewFoldingPrevious=Edellinen
ActionViewFullScreen:h=Näytä tai piilota koko näyttö
ActionViewFullScreen:s=F11
ActionViewFullScreen=Koko näyttö
ActionViewHexEditor:h=Näytä tai piilota heksaeditori
ActionViewHexEditor:s=Ctrl+H
ActionViewHexEditor=Heksaeditori
ActionViewHighlighterSelection:h=Näytä tai piilota korostuksen valinta
ActionViewHighlighterSelection=&Korostus
ActionViewLineNumbers:h=Vaihda rivinumerointi
ActionViewLineNumbers=Rivinumerointi
ActionViewMainMenu:h=Näytä tai piilota päävalikko
ActionViewMainMenu=Päävalikko
ActionViewMenuBar:h=Näytä tai piilota valikkorivi
ActionViewMenuBar=Valikkorivi
ActionViewMiniMap:h=Näytä tai piilota minikartta
ActionViewMiniMap=Minikartta
ActionViewNextPage:h=Mene seuraavalle sivulle
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=Seuraava sivu
ActionViewOutput:h=Näytä tai piilota hakutulokset
ActionViewOutput=&Hakutulokset
ActionViewPreviousPage:h=Mene edelliselle sivulle
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=Edellinen sivu
ActionViewRuler:h=Näytä tai piilota viivain
ActionViewRuler=Viivain
ActionViewSelectionMode:h=Vaihda valintatila. Myös Altin painaminen editorissa vaihtaa valintatilan.
ActionViewSelectionMode=&Valintatila
ActionViewSFTP=SFTP
ActionViewSFTPConnect=Yhdistä
ActionViewSFTPDisconnect=Katkaise
ActionViewSFTPEdit=Muokkaa
ActionViewSkinSelector=Tyylin valinta
ActionViewSpecialChars:h=Vaihda erikoismerkit
ActionViewSpecialChars=&Erikoismerkit
ActionViewSplit:h=Jaa editori
ActionViewSplit=&Jako
ActionViewSplitHorizontal:h=Vaakasuora jako
ActionViewSplitHorizontal=Vaakasuora
ActionViewSplitVertical:h=Pystysuora jako
ActionViewSplitVertical=Pystysuora
ActionViewStatusBar:h=Näytä tai piilota tilarivi
ActionViewStatusBar=T&ilarivi
ActionViewSyncEdit:h=Näyä tai piilota synkronoitu muokkaus
ActionViewSyncEdit:s=Shift+Ctrl+H
ActionViewSyncEdit=Synkronoitu muokkaus
ActionViewTitleBar=Otsikkopalkki
ActionViewTitleBarApplicationName:h=Näytä tai piilota otsikkorivin ohjelman nimi 
ActionViewTitleBarApplicationName=Ohjelman nimi
ActionViewTitleBarFavourite:h=Näytä tai piilota otsikkorivin suosikki
ActionViewTitleBarFavourite=Suosikki
ActionViewTitleBarFileList:h=Näytä tai piilota otsikkopalkin tiedostolista
ActionViewTitleBarFileList=Tiedostolista
ActionViewTitleBarFilename:h=Näytä tai piilota otsikkopalkin tiedostonimi
ActionViewTitleBarFilename=Tiedostonimi
ActionViewTitleBarMagnifier:h=Näytä tai piilota otsikkopalkin suurennuslasi
ActionViewTitleBarMagnifier=Suurennuslasi
ActionViewToolbar:h=Näytä tai piilota työkalupalkki
ActionViewToolbar=Työkalupalkki
ActionViewWordWrap:h=Vaihda rivitys
ActionViewWordWrap=&Rivitys
ActionViewXMLTree:h=Näytä tai piilota XML-puu
ActionViewXMLTree=&XML-puu
ActionViewZoomEditorIn:h=Editorin tarkennus sisään
ActionViewZoomEditorIn=Tarkenna sisään
ActionViewZoomEditorOut:h=Editorin tarkennus ulos
ActionViewZoomEditorOut=Tarkenna ulos
ActionViewZoomEditorReset:h=Editorin tarkkenunksen palautus
ActionViewZoomEditorReset=Tarkennuksen palautus
ActionXMLTreeRefresh:h=Päivitä XML-puu
ActionXMLTreeRefresh=&Päivitä

[Message]
CannotFindString=Merkkijonoa "%s" ei löydy
DuplicatesWereNotFound=Kopioita ei löytynyt
InstallNewVersion=Asennetaanko uusi ohjelmistoversio?
LatestVersion=Käytät viimeisintä versiota.
NoDefaultPrinter=Oletuskirjoitinta ei ole valittu.
PdfErrorPassword=Salasana vaaditaan tai salasana on virheellinen. 
ScaleChange=Jotkin skaalausmuutokset eivät ehkä näy oikein, ennen kuin käynnistät sovelluksen uudelleen.
SelectFilePathFromDirectory=Valitse tiedostopolku hakemistosta

[OptionsApplicationFrame]
CheckBoxAddApplicationInOpentWithContextMenu=Lisää sovellus 'Avaa sovelluksessa' -valikkoon
CheckBoxAllowExitWithEsc=Salli poistuminen esc:llä
CheckBoxAllowMultipleInstances=Salli useat esiintymät
CheckBoxCloseMinimizes=Sulje minimoi
CheckBoxDropFiles=Salli tiedostojen pudotus
CheckBoxHotExit:h=Sulje ilman kehotusta tallentaa tiedostoja, tiedostot säilytetään ja palautetaan.
CheckBoxHotExit=Kuuma sulkeminen
CheckBoxMinimizeToSystemTray=Pienennä järjestelmäalustalle
CheckBoxStayOnTop=Pysy päällimmäisenä
CheckBoxUseLatestCommonDialogs=Käytä viimeisimpiä yleisiä dialogeja
CheckBoxUseReverseUTF8Naming=Käytä käänteistä UTF-8-koodauksen nimeämistä
ComboBoxLanguage=Kieli
SpinEditReopenMaxFileCount=Uudelleen avattavien tiedostojen enimmäismäärä
SpinEditSplitterSize=Jakajan koko

[OptionsApplicationScalingFrame]
RadioButtonAuto=Automaattinen
RadioButtonPercent=Prosentti
RadioButtonPixelsPerInch=Pikseleitä per tuuma

[OptionsApplicationUpdatesFrame]
CheckBoxCheckForUpdatesAtStartup=Tarkista käynnistyksen yhteydessä
CheckBoxCheckForUpdatesWhenClosing=Tarkista suljettaessa

[OptionsApplicationClipboardHistoryFrame]
CheckBoxClipboardHistoryEnabled=Käytössä
SpinEditClipboardHistoryItemsCount=Kohteiden lukumäärä

[OptionsApplicationModifiedFilesFrame]
CheckBoxAskToReloadModifiedFiles=Kysy ladataanko uudelleen
CheckBoxMoveCaretAtTheEnd=Siirrä kohdistin loppuun uudelleen latauksen jälkeen
CheckBoxReloadAutomaticallyModifiedFiles=Lataa uudelleen automaattisesti
CheckBoxPollFileChanges=Tarkasta tiedostomuutokset
SpinEditPollingInterval=Tarkastuksen aikaväli (ms)

[OptionsDirectoryFrame]
CheckBoxAutoHide=Piilota automaattisesti
CheckBoxAutoSelect=Valitse automaattisesti
CheckBoxUseSelectedPathAsDefaultDirectory=Käytä valittua tiedostopolkua oletushakemistona
CheckBoxShowArchiveFiles=Näytä arkistotiedostot
CheckBoxShowHiddenFiles=Näytä piilotiedostot
CheckBoxShowOverlayIcons=Näytä peittokuvakkeet
CheckBoxShowSystemFiles=Näytä systeemitiedostot
CheckBoxShowTreeLines=Näytä puun viivat
CheckBoxUseExplorerTheme=Käytä tiedostonhallinnan teemaa
ComboBoxAlign=Sijainti
SpinEditIndent=Sisennys
SpinEditMargin=Marginaali

[OptionsDirectoryTabsFrame]
CheckBoxBoldActiveTab=Lihavoi aktiivinen välilehti
CheckBoxCloseTabByDblClick=Sulje välilehti tuplaklikkauksella
CheckBoxCloseTabByMiddleClick=Sulje välilehti keskipainikkeella
CheckBoxEnlargeActiveTab=Suurenna aktiivinen välilehti
CheckBoxMultiline=Monirivinen
CheckBoxRightClickSelect=Oikean painikkeen valinta
CheckBoxSaveTabs=Tallenna välilehdet
CheckBoxShowIcon=Näytä kuvake
CheckBoxShowOpenDirectoryButton=Näytä Avaa hakemisto -painike
ComboBoxShowCloseButton=Näytä Sulje-painike
GroupBoxFont=Kirjasin
GroupBoxFontSize=Kirjasimen koko
RadioButtonFontCustom=Määrittele
RadioButtonFontDefault=Oletus
RadioButtonFontSizeCustom=Määrittele
RadioButtonFontSizeDefault=Oletus
SpinEditTabHeight=Korkeus
SpinEditTabMargin=Marginaali
SpinEditTabSpacing=Väli

[OptionsEditorBackupFrame]
CheckBoxActive=Käytössä
EditFileExtension=Tiedostopääte
GroupBoxPath=Polku
GroupBoxSuffix=Jälkiliite
RadioButtonPathCustom=Määrittele
RadioButtonPathFile=Tiedosto
RadioButtonSuffixCounter=Laskuri
RadioButtonSuffixDateAndTime=Päiväys ja aika
RadioButtonSuffixNone=Ei mitään

[OptionsEditorBookmarkListFrame]
CheckBoxShowFilters=Näytä suodattimet 
CheckBoxShowLineNumbers=Näytä rivinumerot 
CheckBoxTrimText=Trimmaa teksti
CheckBoxUpdateForAllBookmarkLists=Päivitys kaikille kirjanmerkkiluetteloille 
CheckBoxUpdateWidthWhenResized=Päivitä leveys, kun kokoa muutetaan 
CheckBoxVisible=Näytä
ComboBoxAlign=Sijainti
GroupBoxSortBy=Lajittele
RadioButtonSortByColor=Värin mukaan
RadioButtonSortByLineNumber=Rivinumeron mukaan
RadioButtonSortByText=Tekstin mukaan
SpinEditWidth=Leveys

[OptionsEditorCaretFrame]
CheckBoxMultipleCaretsActive=Käytössä
CheckBoxMultipleCaretsShowActiveLine=Näytä aktiivinen rivi
CheckBoxMultipleCaretsShowGhost=Näytä haamu
CheckBoxNonblinkingCaretActive=Käytössä
CheckBoxRightMouseClickMovesCaret=Oikean hiiren painikkeen painallus liikuttaa kohdistinta
CheckBoxVisible=Näytä
ColorComboBoxNonblinkingCaretBackground=Taustaväri
ColorComboBoxNonblinkingCaretForeground=Piirtoväri
ComboBoxStylesInsertCaret=Lisäys
ComboBoxStylesOverwriteCaret=Ylikirjoitus
GroupBoxMultipleCarets=Useita kohdistimia
GroupBoxNonBlinkingCaret=Vilkkumaton kohdistin
GroupBoxStyles=Tyylit

[OptionsEditorColorFrame]
ActionReset=Palauta
CheckBoxElementsAttributesBold=Lihavoitu
CheckBoxElementsAttributesItalic=Kursiivi
CheckBoxElementsAttributesUnderline=Alleviivattu
CheckBoxSkinActiveLineBackground=Aktiivisen rivin taustaväri
CheckBoxSkinBackground=Taustaväri
CheckBoxSkinBookmarkPanelBackground=Kirjanmerkkipaneelin taustaväri
CheckBoxSkinCodeFoldingBackground=Koodin taiton taustaväri
CheckBoxSkinCodeFoldingHintBackground=Koodin taittovinkin taustaväri
CheckBoxSkinCompletionProposalBackground=Täydennysehdotuksen taustaväri
CheckBoxSkinCompletionProposalSelectionBackground=Täydennysehdotuksen valinnan taustaväri
CheckBoxSkinForeground=Piirtoväri
CheckBoxSkinLeftMarginBackground=Vasemman marginaalin taustaväri
CheckBoxSkinSelectionBackground=Valinnan taustaväri
CheckBoxSkinSelectionForeground=Valinnan piirtoväri
ColorComboBoxEditorColor=Väri
ColorComboBoxElementsBackground=Taustaväri
ColorComboBoxElementsForeground=Piirtoväri
ComboBoxColorTheme=Väriteema
ComboBoxEditorElement=Elementti
ComboBoxElementsName=Nimi
ComboBoxHighlighter=Korostus
DateEditDate=Päivämäärä
EditEmail=Sähköposti
EditName=Nimi
EditVersion=Versio
GroupBoxAttributes=Ominaisuudet
LabelSkinDescription=Käytä tyylin väriä valituille elementeille
TabSheetAuthor=Tekijä
TabSheetEditor=Editori
TabSheetElements=Elementit
TabSheetGeneral=Yleinen
TabSheetUseSkinColor=Käytä tyylin väriä

[OptionsEditorCompletionProposalFrame]
CheckBoxActive=Käytössä
CheckBoxAddHighlighterKeywords=Lisää korostuksen avainsanat
CheckBoxAutoInvoke=Automaattisesti esiin
CheckBoxMatchCase=Merkkikokoriippuvaisuus
CheckBoxParseWordsFromText=Hae sanat tekstistä
CheckBoxShowSnippets=Näytä katkelmat
ComboBoxKeywordCase=Avainsanan merkkikoko
ComboBoxShortcut=Pikavalinta
SpinEditNumberOfRows=Rivien määrä

[OptionsEditorCompletionProposalSnippetsFrame]
ActionAdd:h=Lisää katkelma
ActionAdd=Lisää
ActionClone:h=Kopioi katkelma
ActionClone=Kopioi
ActionDelete:h=Poista valittu katkelma
ActionDelete=Poista
ActionEdit:h=Muokkaa katkelmaa
ActionEdit=Muokkaa
VirtualDrawTree:0=Katkelma
VirtualDrawTree:1=Kuvaus

[SnippetEditDialog]
CheckBoxCursorPositionActive=Käytössä
CheckBoxSelectionActive=Käytössä
ComboBoxExecuteWith=Suorita
ComboBoxGroupName=Ryhmän nimi
ComboBoxHighlighter=Korostus
ComboBoxShortcut=Pikavalinta
EditDescription=Kuvaus
EditKeyword=Avainsana
GroupBoxCursorPosition=Kohdistimen sijainti 
GroupBoxSelection=Valinta
SpinEditCursorPositionColumn=Sarake
SpinEditCursorPositionRow=Rivi
SpinEditSelectionFromColumn=Sarakkeesta
SpinEditSelectionFromRow=Riviltä
SpinEditSelectionToColumn=Sarakkeeseen
SpinEditSelectionToRow=Riville
TextEditor=Katkelma

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=Väriteema
ComboBoxDefaultEncoding=Koodaus
ComboBoxDefaultHighlighter=Koroste
ComboBoxDefaultSQLHighlighter=SQL koroste
EditBrowser=Selain
GroupBoxDirectory=Hakemisto
RadioButtonCurrentWindowsDirectory=Nykyinen Windowsin hakemisto 
RadioButtonCustomDirectory=Mukautettu hakemisto 
RadioButtonLatestDirectory=Viimeisin hakemisto

[OptionsEditorFoldingFrame]
CheckBoxExpandByHintClick=Avaa luhistettu taitos vihjettä klikkaamalla
CheckBoxFoldMultilineComments=Taita moniriviset kommentit
CheckBoxHighlightIndentGuides=Korosta sisennysohjaimet
CheckBoxHighlightMatchingPair=Korosta vastinparit
CheckBoxShowCollapsedCodeHint=Näytä luhistettu koodi vihjeenä
CheckBoxShowCollapsedLine=Näytä luhistettu viiva
CheckBoxShowCollapseMarkAtTheEnd=Näytä luhistusmerkki lopussa
CheckBoxShowIndentGuides=Näytä sisennysohjaimet
CheckBoxShowTreeLine=Näytä puun viiva
CheckBoxTextFoldingActive=Käytössä
CheckBoxVisible=Näytä
ComboBoxGuideLineStyle=Opasviivan tyyli
ComboBoxMarkStyle=Merkin tyyli
GroupBoxCodeFolding=Koodin taitto
GroupBoxTextFolding=Tekstin taitto
RadioButtonOutlinedByACharacter=Sisennetty merkillä
RadioButtonOutlinedBySpacesAndTabs=Sisennetty välilyönneillä ja tabulaattorilla
SpinEditCollapsedRowCharacterCount=Taitetun rivin merkkien määrä
SpinEditDelayInterval=Viivästysväli (ms)
SpinEditHintRowCount=Vihjerivien lukumäärä

[OptionsEditorFontFrame]
ActionReset=Palauta
CheckBoxUseSameSettingsForAllColorThemes=Käytä samoja asetuksia kaikille väriteemoille
ComboBoxColorTheme=Väriteema
ComboBoxElement=Elementti
FontComboBoxFont=Kirjasin
SpinEditFontSize=Kirjasimen koko

[OptionsEditorLeftMarginFrame]
CheckBoxAutoSize=Automaattinen koko
CheckBoxLineStateShowOnlyModified=Näytä vain muokkaus
CheckBoxLineStateVisible=Näytä
CheckBoxVisible=Näytä
ComboBoxLineStateAlign=Sijainti
GroupBoxLineState=Rivin tila
SpinEditWidth=Leveys

[OptionsEditorLeftMarginBookmarksFrame]
CheckBoxSaveBookmarks=Tallenna kirjanmerkit
CheckBoxShowBookmarkColorsPopup=Näytä kirjanmerkkien värien ponnahdusikkuna 
CheckBoxShowPanel=Näytä paneeli
CheckBoxVisible=Näytä
ColorComboBoxLineColor=Rivin väri
SpinEditPanelWidth=Paneelin leveys

[OptionsEditorLeftMarginLineNumbersFrame]
CheckBoxShowAfterLastLine=Rivinumerointi viimeisen rivin jälkeen
CheckBoxShowInTens=Numerointi kymmenen välein
CheckBoxShowLeadingZeros=Näytä etunollat 
CheckBoxVisible=Näytä
SpinEditStartFrom=Alkaen

[OptionsEditorMatchingPairFrame]
CheckBoxAutoComplete=Automaattinen täyttö
CheckBoxHighlightActive=Käytössä
CheckBoxHighlightAfterToken=Viimeisen kirjaimen jälkeen
CheckBoxHighlightUnmatched=Parittomat
GroupBoxDisplay=Esitystapa
GroupBoxHighlight=Korostus
RadioButtonHighlight=Korostus
RadioButtonUnderline=Alleviivaus

[OptionsEditorMinimapFrame]
CheckBoxBlendingEnabled=Käytössä
CheckBoxBlendingInvert=Käänteinen
CheckBoxShowBookmarks=Näytä kirjanmerkit
CheckBoxShowBorder=Näytä reuna
CheckBoxShowIndentGuides=Näytä sisennysapuviivat
CheckBoxShowSearchResults=Näytä hakutulokset
CheckBoxShowSelection=Näytä valinta
CheckBoxShowShadow=Näytä varjo
CheckBoxVisible=Näytä
ComboBoxAlign=Sijainti
GroupBoxBlending=Sekoitus
SpinEditWidth=Leveys

[OptionsEditorOptionsFrame]
CheckBoxAutoChangeEncoding=Muuta koodausta automaattisesti, kun se tallennetaan
CheckBoxAutoIndent=Automaattinen sisennys
CheckBoxAutoSave=Automaattinen tallennus
CheckBoxDragDropEditing=Raaha ja pudota muokkaus
CheckBoxGroupUndo=Ryhmä peruutus
CheckBoxSaveUnmodified=Tallenna muokkaamattomana 
CheckBoxShowControlCharacters=Näytä ohjausmerkit 
CheckBoxShowNonBreakingSpaceAsSpace=Näytä murtamaton välilyönti välilyöntinä
CheckBoxShowNullCharacters=Näytä tyhjät merkit
CheckBoxShowWarningBeforeSaving=Näytä varoitus ennen tallentamista
CheckBoxShowZeroWidthSpaceCharacters=Näytä nollaleveät välilyönnit 
CheckBoxTrailingLineBreak=Rivinvaihto viimeisen rivin jälkeen
CheckBoxTrimTrailingSpaces=Trimmaa lopussa olevat välilyönnit
CheckBoxUndoAfterSave=Peruutus tallennuksen jälkeen
ComboBoxDefaultLineBreak=Oletus rivinvaihto
GroupBoxInternationalCharacters=Kansainväliset merkit ASCII/ANSI-koodauksella
SpinEditBorderWidth=Rajan leveys
SpinEditLineSpacing=Riviväli
SpinEditMargin=Marginaali

[OptionsEditorRightMarginFrame]
CheckBoxAutoLineBreak=Automaattinen rivinvaihto
CheckBoxMouseMove=Liikuta hiirellä
CheckBoxShowMovingHint=Näytä liikkuva vihje
CheckBoxVisible=Näytä
SpinEditPosition=Sijainti

[OptionsEditorRulerFrame]
CheckBoxShowSelection=Näytä valinta
CheckBoxVisible=Näytä
SpinEditHeight=Korkeus

[OptionsEditorScrollFrame]
CheckBoxAutosizeMaxWidth=Automaattinen maksimi pituus
CheckBoxHalfPage=Puoli sivua
CheckBoxHintFollows=Vihje seuraa
CheckBoxPastEndOfFile=Vieritä tiedoston lopun yli
CheckBoxPastEndOfLineMarker=Vieritä rivin lopun yli
CheckBoxShowHint=Näytä vierityspalkin vihje
CheckBoxShowHorizontalScrollBar=Näytä horisontaalinen vierityspalkki
CheckBoxShowShadow=Näytä varjo
CheckBoxShowVerticalScrollBar=Näytä pystysuora vierityspalkki

[OptionsEditorSearchFrame]
CheckBoxAutoCompleteEnabled=Käytössä
CheckBoxBeepIfSearchStringNotFound=Piippaa, jos etsittyä merkkijonoa ei löydy
CheckBoxClearWhenClosed=Tyhjennä suljettaessa
CheckBoxEntireScope=Koko laajuus
CheckBoxFileSpecificSearch=Tiedostokohtainen haku
CheckBoxFindWordAtCursor=Etsi kursorin kohdalla olevaa sanaa
CheckBoxHighlightResult=Korosta tulokset
CheckBoxMatchCase=Merkkikokoriippuvaisuus
CheckBoxNearOperatorEnabled=Käytössä
CheckBoxSearchOnTyping=Etsi kirjoitettaessa
CheckBoxSearchOnTypingEnabled=Käytössä
CheckBoxSetFocusIntoEditorWithEnter=Aseta kohdistus editoriin Enter-näppäimellä
CheckBoxShowSearchMap=Näytä hakukartta
CheckBoxShowSearchMatchNotFound=Näytä "Etsittyä merkkijonoa ei löydy." -viesti
CheckBoxShowSearchStringNotFound=Näytä "Etsittyä merkkijonoa ei löydy. Käynnistetäänkö etsintä tiedoston alusta uudelleen?" -viesti
CheckBoxToggleSearchBar=Näytä tai piilota hakupalkki
CheckBoxUseUpAndDownArrowKeysToFind=Käytä ylös ja alas nuolinäppäimiä etsimiseen
CheckBoxVisible=Näytä
CheckBoxWholeWords=Kokonaiset sanat
CheckBoxWrapAround=Aloita alusta, jos ei löydy
ComboBoxSearchBarAlign=Hakupalkin sijainti
ComboBoxSearchMapAlign=Hakukartan sijainti
GroupBoxAutoComplete=Automaattinen täyttö
GroupBoxNearOperator:h=Syntaksi: Sana1 NEAR Sana2 tai Sana1 NEAR:d Sana2, jossa d on sanojen enimmäisetäisyys. 
GroupBoxNearOperator=NEAR operaattori
GroupBoxSearchOnTyping=Etsi kirjoittaessa
SpinEditAutoCompleteDelayInterval=Viivästysväli (ms)
SpinEditNearOperatorMinimumDistance=Vähimmäisetäisyys
SpinEditNearOperatorMaximumDistance=Enimmäisetäisyys
SpinEditSearchOnTypingDelayInterval=Viivästysväli (ms)

[OptionsEditorSelectionFrame]
CheckBoxALTSetsColumnMode=ALT asettaa saraketilan
CheckBoxAutoCopyToClipboard=Kopioi automaattisesti leikepöydälle
CheckBoxExpandPrefixCharacters=Laajenna etumerkit
CheckBoxExpandRealNumbers=Laajenna liukuluvut
CheckBoxFromEndOfLine=Rivin lopusta
CheckBoxHighlightSimilarTerms=Korosta valinnan mukaan
CheckBoxTermsMatchCase=Korostetulla valinnalla merkkikokoriippuvaisuus
CheckBoxToEndOfLastLine=Viimeisen rivin loppuun
CheckBoxToEndOfLine=Rivin loppuun
CheckBoxTripleClickRowSelect=Rivin valinta kolmoispainalluksella
CheckBoxVisible=Näytä

[OptionsEditorSortFrame]
CheckBoxCaseSensitive=Kirjainkoko huomioidaan
CheckBoxNaturalSortOrder=Luonnollinen lajittelujärjestys

[OptionsEditorSpecialCharsFrame]
CheckBoxLineBreakVisible=Näytä
CheckBoxSelectionVisible=Näytä
CheckBoxVisible=Näytä
ColorComboBoxLineBreakColor=Väri
ColorComboBoxSelectionColor=Väri
ComboBoxArrowStyle=Nuolen tyyli
ComboBoxLineBreakStyle=Tyyli
GroupBoxColor=Väri
GroupBoxLineBreak=Rivinvaihto
GroupBoxSelection=Valinta
RadioButtonCustomColor=Valittu
RadioButtonMiddleColor=Keskikohta
RadioButtonTextColor=Teksti

[OptionsEditorSpellCheckFrame]
CheckBoxActive=Käytössä
ColorComboBoxUnderlineColor=Väri
ComboBoxDictionary=Sanakirja
ComboBoxUnderlineType=Tyyppi
GroupBoxUnderline=Alleviivaus

[OptionsEditorSyncEditFrame]
CheckBoxActive=Käytössä
CheckBoxMatchCase=Merkkikokoriippuvaisuus
CheckBoxShowActivateIcon=Näytä aktivointi-ikoni

[OptionsEditorTabsFrame]
CheckBoxBoldActiveTab=Lihavoi aktiivinen välilehti
CheckBoxCloseTabByDblClick=Sulje välilehti tuplaklikkauksella
CheckBoxCloseTabByMiddleClick=Sulje välilehti keskipainikkeella
CheckBoxDimReadOnlyWhenNotActive=Himmennä vain luku -tilassa, kun ei aktiivinen
CheckBoxEnlargeActiveTab=Suurenna aktiivinen välilehti
CheckBoxHideCloseButtonWhenCanCloseIsNotChecked=Piilota sulje-painike, kun voi sulkea ei ole valittu
CheckBoxMultiline=Monirivinen
CheckBoxRightClickSelect=Oikean painikkeen valinta
CheckBoxSaveTabs=Tallenna välilehdet
CheckBoxShowFileNameAsHint=Näytä tiedoston nimi vihjeenä
CheckBoxShowIcon=Näytä kuvake
CheckBoxShowNewFileButton=Näytä uusi tiedosto -painike
ComboBoxShowCloseButton=Näytä sulje-painike
GroupBoxFont=Kirjasin
GroupBoxFontSize=Kirjasimen koko
RadioButtonFontCustom=Määrittele
RadioButtonFontDefault=Oletus
RadioButtonFontSizeCustom=Määrittele
RadioButtonFontSizeDefault=Oletus
SpinEditTabHeight=Korkeus
SpinEditTabMargin=Marginaali
SpinEditTabSpacing=Väli

[OptionsEditorTabulatorFrame]
CheckBoxColumns=Sarakkeet
CheckBoxPreviousLineIndent=Edellisen rivin sisennys
CheckBoxSelectedBlockIndent=Valitun tekstin sisennys
CheckBoxTabsToSpaces=Sarkaimet välilyönneiksi
SpinEditWidth=Pituus

[OptionsEditorWordWrapFrame]
CheckBoxActive=Käytössä
ComboBoxWidth=Pituus

[OptionsEditorXMLTreeFrame]
CheckBoxUseExplorerTheme=Käytä tiedostonhallinnan teemaa
CheckBoxVisible=Näytä
ComboBoxAlign=Sijainti
SpinEditWidth=Leveys

[OptionsFileTypesFrame]
EditExtensions=Tunnisteet
VirtualDrawTree:0=Tiedostotyyppi

[OptionsForm]
ActionApplication=Sovellus
ActionApplicationClipboardHistory=Leikepöytähistoria
ActionApplicationModifiedFiles=Muokatut tiedostot
ActionApplicationScaling=Skaalaus
ActionApplicationUpdates=Päivitykset
ActionCompare=Tekstitiedostojen vertailu
ActionDirectory=Hakemisto
ActionDirectoryTabs=Välilehdet
ActionEditor=Editori
ActionEditorBackup=Varmuuskopio
ActionEditorBookmarkList=Kirjanmerkkiluettelo
ActionEditorCaret=Kohdistin
ActionEditorColors=Värit
ActionEditorCompletionProposal=Täydennysehdotus
ActionEditorCompletionProposalSnippets=Katkelmat
ActionEditorDefaults=Oletusarvot
ActionEditorFolding=Taitto
ActionEditorFonts=Kirjasin
ActionEditorLeftMargin=Vasen marginaali
ActionEditorLeftMarginBookmarks=Kirjanmerkit
ActionEditorLeftMarginLineNumbers=Rivinumerot
ActionEditorMatchingPair=Yhteensopivat parit
ActionEditorMinimap=Minikartta
ActionEditorRightMargin=Oikea marginaali
ActionEditorRuler=Viivain
ActionEditorScroll=Vieritys
ActionEditorSearch=Etsi
ActionEditorSelection=Valinta
ActionEditorSort=Järjestä
ActionEditorSpecialChars=Erikoismerkit
ActionEditorSpellCheck=Oikeinkirjoittaja
ActionEditorSyncEdit=Synkronoitu muokkaus
ActionEditorTabs=Välilehdet
ActionEditorTabulator=Tabulaattori
ActionEditorWordWrap=Rivitys
ActionEditorXMLTree=XML-puu
ActionFileTypes=Tiedostotyypit
ActionHexEditor=Heksaeditori
ActionHTMLExport=HTML -vienti
ActionImageView=Kuvanäkymä
ActionJSONFormatter=JSON-muotoilija
ActionMainMenu=Päävalikko
ActionMarkdownPreview=Markdown -esikatselu
ActionMarkdownPreviewOptions=Vaihtoehdot
ActionMenuBar=Valikkorivi
ActionMenuBarButtons=Painikkeet
ActionMenuBarTabs=Välilehdet
ActionOpen:h=Tallenna asetukset INI -tiedostoon
ActionOpen=Avaa...
ActionOutput=Tuloste
ActionOutputTabs=Välilehdet
ActionPDFView=PDF -näkymä
ActionPrint=Tulostus
ActionSaveAs:h=Lue asetukset INI -tiedostosta
ActionSaveAs=Tallenna...
ActionSkin=Teema
ActionSkinButtons=Painikkeet
ActionSkinEffects=Efektit
ActionSkinFont=Kirjaisin
ActionSkinHints=Vihjeet
ActionSkinScrollBars=Vierityspalkit
ActionSkinStyles=Tyylit
ActionSQLFormatter=SQL-muotoilija
ActionSQLFormatterCapitalization=Isot kirjaimet
ActionSQLFormatterFormatting=Muotoilu
ActionSQLFormatterIndentation=Sisennys
ActionStatusBar=Tilarivi
ActionTitleBar=Otsikkopalkki
ActionToolbar=Työkalurivi
ActionToolbarOptions=Vaihtoehdot
ActionXMLFormatter=XML-muotoilija
Caption=Asetukset
EditorTabsAction=Sivut

[OptionsHexEditorFrame]
CheckBoxAutosize=Automaattinen koko
CheckBoxHexLowerCase=Hexassa pienet kirjaimet
CheckBoxInsertMode=Lisäystila
CheckBoxShowRuler=Näytä viivain
ComboBoxCaretStyle=Kohdistimen tyyli

[OptionsHTMLExportFrame]
CheckBoxAddToClipboard=Lisää leikepöydälle
CheckBoxShowLineNumbers=Näytä rivinumerot

[OptionsMainMenuFrame]
GroupBoxFont=Kirjasin
GroupBoxFontSize=Kirjasimen koko
RadioButtonFontCustom=Määrittele
RadioButtonFontDefault=Oletus
RadioButtonFontSizeCustom=Määrittele
RadioButtonFontSizeDefault=Oletus

[OptionsMarkdownPreviewFrame]
CheckBoxVisible=Näytä
CheckBoxAutoSize=Automaattinen koko
CheckBoxUseColorTheme=Käytä väriteemaa
SpinEditWidth=Leveys
ComboBoxAlign=Sijainti

[OptionsMarkdownPreviewOptionsFrame]
CheckBoxBackslashEspacesHTMLTags=Kenoviiva poistaa HTML-tunnisteet
CheckBoxDisableForcedSpaces=Poista käytöstä vaatimus sisentää alaluettelot 4 välilyönnillä, jotta ne voivat olla sisäkkäin
CheckBoxUnderline=Poista käytöstä alaviivojen jäsennys <em> tai <strong> 
CheckBoxSimplifiedAutoLink=Ota käyttöön automaattinen linkitys pelkissä teksti-URL-osoitteissa
CheckBoxEncodeEmails=Ota käyttöön sähköpostiosoitteen automaattinen hämärtäminen
CheckBoxEmojis=Ota emoji-tuki käyttöön
CheckBoxEllipsis=Ota käyttöön kolmenpisteen muunnos
CheckBoxTasklists=Ota käyttöön tuki GFM-tehtäväluetteloille
CheckBoxMentions=Ota githubin @mention -tuki käyttöön
CheckBoxCodeBlocks=Ota käyttöön GFM-koodilohkotyylisyntaksin tuki (aidatut koodilohkot)
CheckBoxParseImgDimensions=Ota käyttöön tuki kuvan mittojen asettamiseen markdown-syntaksin sisällä
CheckBoxStrikethrough=Ota käyttöön yliviivaussyntaksin tuki
CheckBoxTables=Ota käyttöön taulukoiden syntaksin tuki
CheckBoxExcludeTrailingPunctuationFromURLs=Sulje pois välimerkit automaattisesti linkitetyistä URL-osoitteista
CheckBoxLiteralMiddleWordAsterisks=Kirjaimelliset keskisanan tähdet
CheckBoxOmitExtraWLInCodeBlocks=Jätä uusi rivin pois koodilohkosta
CheckBoxSimpleLineBreaks=Jäsennä rivinvaihdot kuten <br/> kappaleissa (kuten GitHub tekee)
CheckBoxRequireSpaceBeforeHeadingText=Vaadi välilyönti #:n ja otsikkotekstin väliin
CheckBoxSplitAdjacentBlockquotes=Jaa viereiset lainausmerkit
CheckBoxLiteralMiddleWordUnderscores=Käsittele alaviivoja sanojen keskellä kirjaimellisina merkeinä
SpinEditHeaderStartingLevel=Otsikon aloitustaso

[OptionsMenuBarFrame]
ActionAddDivider:h=Lisää jakaja
ActionAddDivider=Lisää jakaja
ActionAddButton:h=Lisää painike
ActionAddButton=Lisää painike
ActionDelete:h=Poista painike
ActionDelete=Poista
ActionMoveDown:h=Siirrä valittu painike alas
ActionMoveDown=Siirrä alas
ActionMoveUp:h=Siirrä valittu painike ylös
ActionMoveUp=Siirrä ylös
ActionReset:h=Palauta alkuperäiset painikkeet
ActionReset=Palauta
VirtualDrawTree:0=Painike
VirtualDrawTree:h=Vedä ja pudota siirtää painikkeita. Klikkaa oikealla popup-valikosta voit lisätä ja poistaa painikkeita.

[OptionsMenuBarTabsFrame]
CheckBoxBoldActiveTab=Lihavoi aktiivinen välilehti
CheckBoxEnlargeActiveTab=Suurenna aktiivinen välilehti
CheckBoxShowMenu=Näytä valikko
GroupBoxTabsFont=Kirjasin
GroupBoxTabsFontSize=Kirjasimen koko
RadioButtonTabsFontCustom=Määrittele
RadioButtonTabsFontDefault=Oletus
RadioButtonTabsFontSizeCustom=Määrittele
RadioButtonTabsFontSizeDefault=Oletus
SpinEditTabHeight=Korkeus
SpinEditTabMargin=Marginaali
SpinEditTabPadding=Täyte
SpinEditTabSpacing=Väli

[OptionsMenuBarButtonsFrame]
CheckBoxBlended=Sekoitettu
CheckBoxGrayed=Harmaa
CheckBoxReflected=Heijastettu
GroupBoxButtonsFont=Kirjasin
GroupBoxButtonsFontSize=Kirjasimen koko
GroupBoxDisabled=Pois käytöstä
GroupBoxIcons=Ikonit
RadioButtonButtonsFontCustom=Määrittele
RadioButtonButtonsFontDefault=Oletus
RadioButtonButtonsFontSizeCustom=Määrittele
RadioButtonButtonsFontSizeDefault=Oletus
RadioButtonLargeIcons=Suuret
RadioButtonSmallIcons=Pienet
TrackEditBlend=Sekoitus

[OptionsOutputFrame]
CheckBoxShowCheckBox=Näytä valintalaatikko
CheckBoxShowOnlyLineNumbers=Näytä vain rivinumerot
CheckBoxShowTreeLines=Näytä puun viivat
CheckBoxUseExplorerTheme=Käytä tiedostonhallinnan teemaa
ComboBoxAlign=Sijainti
SpinEditIndent=Sisennys
SpinEditMargin=Marginaali

[OptionsOutputTabsFrame]
CheckBoxBoldActiveTab=Lihavoi aktiivinen välilehti
CheckBoxCloseTabByDblClick=Sulje välilehti tuplaklikkauksella
CheckBoxCloseTabByMiddleClick=Sulje välilehti keskipainikkeella
CheckBoxEnlargeActiveTab=Suurenna aktiivinen välilehti
CheckBoxMultiline=Monirivinen
CheckBoxRightClickSelect=Oikean painikkeen valinta
CheckBoxSaveTabs=Tallenna välilehdet
CheckBoxShowFindInFilesButton=Näytä etsi tiedostosta -painike
CheckBoxShowIcon=Näytä kuvake
ComboBoxShowCloseButton=Näytä sulje-painike
GroupBoxFont=Kirjasin
GroupBoxFontSize=Kirjasimen koko
RadioButtonFontCustom=Määrittele
RadioButtonFontDefault=Oletus
RadioButtonFontSizeCustom=Määrittele
RadioButtonFontSizeDefault=Oletus
SpinEditTabHeight=Korkeus
SpinEditTabMargin=Marginaali
SpinEditTabSpacing=Väli

[OptionsImageViewFrame]
CheckBoxControlBarVisible=Näytä
CheckBoxEnabled=Käytössä
ComboBoxControlBarAlign=Sijainti
ComboBoxZoom=Tarkennus
GroupBoxControlBar=Ohjauspalkki

[OptionsPDFViewFrame]
CheckBoxControlBarVisible=Näytä
CheckBoxEnabled=Käytössä
CheckBoxSearchBarHighlightAll=Korosta kaikki
CheckBoxSearchBarMatchCase=Merkkikokoriippuvuus
CheckBoxSearchBarToggleSearchBar=Näytä tai piilota hakupalkki
CheckBoxSearchBarVisible=Näytä
CheckBoxSearchBarWholeWords=Kokonaiset sanat
ComboBoxControlBarAlign=Sijainti
ComboBoxSearchBarAlign=Sijainti
ComboBoxZoom=Tarkennus
GroupBoxControlBar=Ohjauspalkki
GroupBoxSearchBar=Hakupalkki

[OptionsPrintFrame]
CheckBoxColorsEnabled=Käytössä
CheckBoxLineNumbersInMargin=Marginaalissa
CheckBoxLineNumbersVisible=Näytä
CheckBoxShowFooterLine=Näytä alatunnisteen viiva
CheckBoxShowHeaderLine=Näytä ylätunnisteen viiva
CheckBoxShowOnlyPageNumber=Näytä vain sivunumero
CheckBoxUseRomanNumerals=Käytä roomalaisia numeroita
CheckBoxVisibleDateTime=Näytä
CheckBoxVisibleFilename=Näytä
CheckBoxVisiblePageNumber=Näytä
CheckBoxVisiblePrintedBy=Näytä
CheckBoxWordWrap=Rivitys
ComboBoxColorTheme=Väriteema
GroupBoxAlignmentDateTime=Kohdistus
GroupBoxAlignmentFilename=Kohdistus
GroupBoxAlignmentPageNumber=Kohdistus
GroupBoxAlignmentPrintedBy=Kohdistus
GroupBoxColors=Värit
GroupBoxDateTime=Päiväys
GroupBoxFilename=Tiedoston nimi
GroupBoxFont=Kirjaisin
GroupBoxFontSize=Kirjaisimen koko
GroupBoxLineNumbers=Rivinumerot
GroupBoxMargins=Marginaalit
GroupBoxPageNumber=Sivunumerointi
GroupBoxPrintedBy=Tulostettu
GroupBoxVerticalAlignmentDateTime=Pystysuuntainen kohdistus
GroupBoxVerticalAlignmentFilename=Pystysuuntainen kohdistus
GroupBoxVerticalAlignmentPageNumber=Pystysuuntainen kohdistus
GroupBoxVerticalAlignmentPrintedBy=Pystysuuntainen kohdistus
RadioButtonAlignmentLeftDateTime=Vasen
RadioButtonAlignmentLeftFilename=Vasen
RadioButtonAlignmentLeftPageNumber=Vasen
RadioButtonAlignmentLeftPrintedBy=Vasen
RadioButtonAlignmentRightDateTime=Oikea
RadioButtonAlignmentRightFilename=Oikea
RadioButtonAlignmentRightPageNumber=Oikea
RadioButtonAlignmentRightPrintedBy=Oikea
RadioButtonFontCustom=Määrittele
RadioButtonFontEditor=Editorin mukainen
RadioButtonFontSizeCustom=Määrittele
RadioButtonFontSizeEditor=Editorin mukainen
RadioButtonVerticalAlignmentFooterDateTime=Alatunniste
RadioButtonVerticalAlignmentFooterFilename=Alatunniste
RadioButtonVerticalAlignmentFooterPageNumber=Alatunniste
RadioButtonVerticalAlignmentFooterPrintedBy=Alatunniste
RadioButtonVerticalAlignmentHeaderDateTime=Ylätunniste
RadioButtonVerticalAlignmentHeaderFilename=Ylätunniste
RadioButtonVerticalAlignmentHeaderPageNumber=Ylätunniste
RadioButtonVerticalAlignmentHeaderPrintedBy=Ylätunniste
SpinEditMarginsBottom=Alareuna
SpinEditMarginsLeft=Vasen reuna
SpinEditMarginsRight=Oikea reuna
SpinEditMarginsTop=Yläreuna
TabSheetHeadedAndFooter=Ylä- ja alatunniste
TabSheetOptions=Asetukset

[OptionsSQLFormatterCapitalizationFrame]
ComboBoxKeywords=Avainsanat
ComboBoxNames=Nimet
ComboBoxParameters=Parametrit

[OptionsSQLFormatterFrame]
CheckBoxAlwaysVisible=Aina näkyvissä
CheckBoxSelectDefaultSQLHighlighter=Valitse oletus SQL-korostin

[OptionsJSONFormatterFrame]
CheckBoxAlwaysVisible=Aina näkyvissä
CheckBoxSelectJSONHighlighter=Valitse JSON-korostin

[OptionsXMLFormatterFrame]
CheckBoxAlwaysVisible=Aina näkyvissä
CheckBoxSelectXMLHighlighter=Valitse XML-korostin

[OptionsSQLFormatterFormattingFrame]
CheckBoxAlignKeywordsRightInStatements=Kohdista avainsanat oikealle lauseissa 
CheckBoxBreakJoinOnSections=Katkaise JOIN ON -osioissa
CheckBoxExpandBetweenConditions=Laajenna ehtojen välillä 
CheckBoxExpandBooleanExpressions=Laajenna totuusarvolausekkeet 
CheckBoxExpandCaseStatements=Laajenna CASE -käskyt 
CheckBoxExpandCommaLists=Laajenna pilkkuluettelot 
CheckBoxExpandGroupByClause=Laajenna GROUP BY -lause 
CheckBoxExpandInLists=Laajenna IN -luettelot 
CheckBoxExpandInsertStatements=Laajenna INSERT -lauseet
CheckBoxExpandJoinOnBooleanExpressions=Laajenna totuusarvolausekkeet 
CheckBoxExpandOrderByClause=Laajenna ORDER BY -lause
CheckBoxSpaceAfterComma=Välilyönti pilkun jälkeen 
CheckBoxTrailingCommas=Pilkut perään

[OptionsSQLFormatterIndentationFrame]
CheckBoxRightPadColumnNames=Käytä sarakkeiden pisintä leveyttä CREATE TABLE tai VIEW -lauseissa
CheckBoxUseTab=Käytä tabulaattoria
SpinEditIndentLength=Sisennyksen pituus

[OptionsStatusBarFrame]
CheckBoxAutoSizePanels=Automaattisen kokoiset paneelit
CheckBoxShowCaretPosition=Näytä kursorin sijainti
CheckBoxShowCharacterCount=Näytä merkkien määrä
CheckBoxShowEditorZoom=Näytä editorin zoomaus
CheckBoxShowEncoding=Näytä koodaus
CheckBoxShowFileLineBreak=Näytä tiedoston rivinvaihto 
CheckBoxShowFileOpeningTime=Näytä tiedoston avaamiseen kuluva aika
CheckBoxShowHints=Näytä vihjeet
CheckBoxShowKeyState=Näytä näppäintila
CheckBoxShowLineCount=Näytä rivimäärä
CheckBoxShowMacro=Näytä makro
CheckBoxShowModified=Näytä muokattu
CheckBoxShowSelectionInfo=Näytä valintatiedot
CheckBoxShowSizeGrip=Näytä koon ote
CheckBoxVisible=Näytä
GroupBoxFont=Kirjasin
GroupBoxFontSize=Kirjasimen koko
RadioButtonFontCustom=Määrittele
RadioButtonFontDefault=Oletus
RadioButtonFontSizeCustom=Määrittele
RadioButtonFontSizeDefault=Oletus

[OptionsTitleBarFrame]
CheckBoxMagnifier=Näytä suurennuslasi
CheckBoxShowApplicationName=Näytä ohjelman nimi
CheckBoxShowColorTheme=Näytä väriteema
CheckBoxShowEncoding=Näytä koodaus
CheckBoxShowFavourite=Näytä suosikki
CheckBoxShowFileList=Näytä tiedostolista
CheckBoxShowFilename=Näytä tiedoston nimi
CheckBoxShowHighlighter=Näytä korostus
CheckBoxShowIcon=Näytä kuvake
CheckBoxShowMenu=Näytä valikko
CheckBoxUseSystemStyle=Käytä järjestelmän tyyliä
GroupBoxFont=Kirjasin
GroupBoxFontSize=Kirjasimen koko
RadioButtonFontCustom=Määrittele
RadioButtonFontDefault=Oletus
RadioButtonFontSizeCustom=Määrittele
RadioButtonFontSizeDefault=Oletus

[OptionsToolbarFrame]
ActionAddDivider:h=Lisää jakaja
ActionAddDivider=Lisää jakaja
ActionAddButton:h=Lisää painike
ActionAddButton=Lisää painike
ActionDelete:h=Poista painike
ActionDelete=Poista
ActionMoveDown:h=Siirrä valittu painike alas
ActionMoveDown=Siirrä alas
ActionMoveUp:h=Siirrä valittu painike ylös
ActionMoveUp=Siirrä ylös
ActionReset:h=Palauta alkuperäiset painikkeet
ActionReset=Palauta
VirtualDrawTree:0=Painike
VirtualDrawTree:h=Vedä ja pudota siirtää painikkeita. Klikkaa oikealla popup-valikosta voit lisätä ja poistaa painikkeita.

[OptionsToolbarOptionsFrame]
GroupBoxBackground=Tausta
GroupBoxIcons=Ikonit
RadioButtonBackgroundHigh=Korkea
RadioButtonBackgroundLow=Matala
RadioButtonBackgroundTransparent=Läpinäkyvä
RadioButtonLargeIcons=Suuret
RadioButtonSmallIcons=Pienet
SpinEditMarginTop=Ylämarginaali

[OptionsMenuBarItemsDialog]
Caption=Valitse kohtia
VirtualDrawTreeAddItems:0=Kohta

[OptionsToolbarItemsDialog]
Caption=Valitse kohtia
VirtualDrawTreeAddItems:0=Kohta

[PrintPreviewForm]
ActionColors:h=Vaihda värit
ActionColors=Värit
ActionExit:h=Sulje esikatselu
ActionExit=Sulje
ActionFirst:h=Ensimmäinen|Mene ensimmäiselle sivulle
ActionFirst=Ensimmäinen
ActionHighlight:h=Vaihda korostus
ActionHighlight=Korostus
ActionLast:h=Viimeinen|Mene viimeiselle sivulle
ActionLast=Viimeinen
ActionLineNumbers:h=Vaihda rivinumerot
ActionLineNumbers=Rivinumerot
ActionNext:h=Seuraava|Mene seuraavalle sivulle
ActionNext=Seuraava
ActionPrevious:h=Edellinen|Mene edelliselle sivulle
ActionPrevious=Edellinen
ActionPrint:h=Tulosta|Tulosta tiedosto
ActionPrint=Tulosta
ActionWordWrap:h=Vaihda rivitys
ActionWordWrap=Rivitys
ActionZoom:h=Koko|Lähennä/loitonna
ActionZoom=Koko
ActionZoomIn:h=Lähennä
ActionZoomIn=Lähennä
ActionZoomOut:h=Loitonna
ActionZoomOut=Loitonna
Caption=Esikatselu

[ReplaceDialog]
ActionClose=Sulje
ActionFindNext=Etsi seuraava
ActionReplace=Korvaa
ActionReplaceAll=&Korvaa kaikki
ActionSearchEngine=Valitse hakumoottori
Caption=Korvaa
CheckBoxMatchCase=Merkkikokoriippuvuus
CheckBoxPromptOnReplace=Kehoite vaihdettaessa
CheckBoxSelectedOnly=Vain valinnasta
CheckBoxWholeWords=Kokonaiset sanat
ComboBoxSearchFor=Etsi
GroupBoxDirection=Suunta
GroupBoxOptions=Valinnat
GroupBoxOrigin=Alkukohta
GroupBoxReplaceIn=Korvaa
RadioButtonActiveFile=Aktiivinen tiedosto
RadioButtonAllOpenFiles=Kaikki avoimet tiedostot
RadioButtonDeleteLine=Poista rivi
RadioButtonDirectionBackward=Taaksepäin
RadioButtonDirectionForward=Eteenpäin
RadioButtonEntireScope=Koko laajuus
RadioButtonOriginFromCursor=Kursorista
RadioButtonReplaceWith=Korvaa

[SearchForFilesForm]
Caption=Etsi tiedostoja
PanelSearchingFiles=Etsitään tiedostoja...

[ShortcutsForm]
Caption=Pikanäppäimet
VirtualDrawTree:0=Pikanäppäin
VirtualDrawTree:1=Otsikko
VirtualDrawTree:2=Ohje

[OptionsSkinFrame]
CheckBoxActive=Aktiivinen
CheckBoxExtendedBordersEnabled=Käytössä
CheckBoxExtendedBordersFull=Täysi
ComboBoxOptimizingPriority=Optimointi prioriteetti
GroupBoxColorization=Väritys
GroupBoxExtendedBorders=Laajennettu reunojen tila
LabelBrightness=Kirkkaus
LabelHueOffset=Värisävy
LabelSaturation=Kylläisyys
LabelTransparency=Läpinäkyvyys
SkinSelector=Teema

[OptionsSkinButtonsFrame]
CheckBoxShowButtonFocusRect=Näytä painikkeen tarkennus
CheckBoxUseButtonColors=Käytä painikkeissa värejä

[OptionsSkinEffectsFrame]
CheckBoxAllowAeroBlurring=Salli aero hämärtyminen
CheckBoxAllowAnimation=Salli animaatio
CheckBoxAllowGlowing=Salli hehku
CheckBoxAllowOuterEffects=Salli ulommat vaikutukset
CheckBoxBlendOnMove=Sulauta näyttö siirrettäessä

[OptionsSkinFontFrame]
RadioButtonFontCustom=Määritä
RadioButtonFontDefault=Oletus
RadioButtonFontFromSkin=Tyylistä

[OptionsSkinHintsFrame]
CheckBoxHintAnimated=Animoitu
ComboBoxHintStyle=Tyyli
SpinEditShowInterval=Näytä aikaväli (ms)
SpinEditHideInterval=Piilota aikaväli (ms)

[OptionsSkinScrollBarsFrame]
CheckBoxArrowButtonsDefaultSize=Oletus koko
CheckBoxArrowButtonsVisible=Näytä
CheckBoxScrollWidthDefaultSize=Oletus koko
GroupBoxArrowButtons=Nuolipainikkeet
GroupBoxScrollBar=Vierityspalkki
SpinEditArrowButtonsSize=Koko
SpinEditScrollWidthSize=Koko

[OptionsSkinStylesFrame]
CheckBoxDirectory=Hakemisto
CheckBoxFiles=Tiedostot
CheckBoxMenuBar=Valikkorivi
CheckBoxOutput=Hakutulokset
CheckBoxUseCardGroupBoxStyle=Käytä korttiryhmätyyliä
ComboBoxArrowStyle=Nuolen tyyli
GroupBoxSimplePageControl=Yksinkertainen sivukontrolli

[TabsSelectDialog]
Caption=Valitse välilehdet
VirtualDrawTree:0=Välilehti

[CharacterMapForm]
Caption=Merkistö

[WarningMessage]
FileAccessError=Tiedoston %s lukuvirhe.

[SaveChangesDialog]
Caption=Tallenna muuttuneet tiedostot
VirtualDrawTree:0=Tiedosto
VirtualDrawTree:1=Polku

[ConnectDialog]
Caption=Yhdistä
EditPassword=Salasana

[UploadDialog]
Caption=Lataa
EditFilename=Tiedoston nimi
EditPath=Polku

[NewFolderDialog]
Caption=Uusi kansio
EditPath=Polku

[DirectoryTabSFTPDialog]
Caption:t=Translation needed
Caption=SFTP-yhteys
CheckBoxSavePassword=Tallenna salasana
CheckBoxShowOutput=Näytä tulos
EditPassword=Salasana
EditPort=Portti
EditPrivateKeyFile=Yksityisen avain tiedosto
EditRootDirectory=Juurihakemisto
EditServer=Palvelin
EditTabName=Välilehden nimi
EditUsername=Käyttäjä